zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00100.atdf
          <instance name="CCL1">
            <register-group name="CCL1" name-in-module="CCL" address-space="base" offset="0x44830000" />
            <signals>
              <signal group="IN" index="0" function="I" pad="PC11" ioset="2" />
              <signal group="IN" index="0" function="I" pad="PC04" ioset="1" />
              <signal group="IN" index="1" function="I" pad="PC17" ioset="2" />
              <signal group="IN" index="1" function="I" pad="PC05" ioset="1" />
              <signal group="IN" index="2" function="I" pad="PC16" ioset="2" />
              <signal group="IN" index="2" function="I" pad="PC10" ioset="1" />
              <signal group="IN" index="3" function="I" pad="PD06" ioset="1" />
              <signal group="IN" index="3" function="I" pad="PD20" ioset="2" />
              <signal group="IN" index="4" function="I" pad="PD16" ioset="2" />
              <signal group="IN" index="4" function="I" pad="PD07" ioset="1" />
              <signal group="IN" index="5" function="I" pad="PD11" ioset="1" />
              <signal group="IN" index="5" function="I" pad="PD12" ioset="2" />
              <signal group="IN" index="6" function="I" pad="PA16" ioset="2" />
              <signal group="IN" index="6" function="I" pad="PA09" ioset="1" />
              <signal group="IN" index="7" function="I" pad="PA17" ioset="2" />
              <signal group="IN" index="7" function="I" pad="PA06" ioset="1" />
              <signal group="IN" index="8" function="I" pad="PA11" ioset="1" />
              <signal group="IN" index="8" function="I" pad="PA12" ioset="2" />
              <signal group="IN" index="9" function="I" pad="PB11" ioset="2" />
              <signal group="IN" index="9" function="I" pad="PB04" ioset="1" />
              <signal group="IN" index="10" function="I" pad="PB13" ioset="2" />
              <signal group="IN" index="10" function="I" pad="PB03" ioset="1" />
              <signal group="IN" index="11" function="I" pad="PB07" ioset="2" />
              <signal group="IN" index="11" function="I" pad="PB08" ioset="1" />
              <signal group="OUT" index="0" function="I" pad="PC19" ioset="2" />
              <signal group="OUT" index="0" function="I" pad="PC06" ioset="1" />
              <signal group="OUT" index="1" function="I" pad="PD15" ioset="2" />
              <signal group="OUT" index="1" function="I" pad="PD09" ioset="1" />
              <signal group="OUT" index="2" function="I" pad="PA05" ioset="1" />
              <signal group="OUT" index="2" function="I" pad="PA20" ioset="2" />
              <signal group="OUT" index="3" function="I" pad="PB00" ioset="1" />
              <signal group="OUT" index="3" function="I" pad="PB17" ioset="2" />
            </signals>
            <parameters>
              <param name="LUT_NUM" value="4" caption="Number of LUT in a CCL" />
              <param name="GCLK_ID" value="37" />
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="24" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="43" caption="Instance index for CCL1" />
              <param name="MCLK_ID_APB" value="53" caption="Index for CCL1 APB clock" />
              <param name="PAC_ID" value="43" caption="Index for CCL1 registers write protection" />
            </parameters>
          </instance>
        </module>
        <module name="CoreDebug" id="SYSTEM_IP" version="1.0.0">
          <instance name="CoreDebug">
            <register-group name="CoreDebug" name-in-module="CoreDebug" address-space="base" offset="0xE000EDF0" />
          </instance>
          <instance name="CoreDebug_NS">
            <register-group name="CoreDebug_NS" name-in-module="CoreDebug" address-space="base" offset="0xE002EDF0" />
          </instance>
        </module>
        <module name="DIB" id="SYSTEM_IP" version="1.0.0">
          <instance name="DIB">
            <register-group name="DIB" name-in-module="DIB" address-space="base" offset="0xE000EFB0" />
          </instance>
          <instance name="DIB_NS">
            <register-group name="DIB_NS" name-in-module="DIB" address-space="base" offset="0xE002EFB0" />
          </instance>
        </module>
        <module name="DMAC" id="dma_u2223_v2" name2="dma_u2223_v2" version="2i0">
          <instance name="DMAC">
            <register-group name="DMAC" name-in-module="DMAC" address-space="base" offset="0x44802000" />
            <parameters>
              <param name="CH_NUM" value="8" caption="--" />
              <param name="EVIN_NUM" value="4" caption="--" />
              <param name="EVOUT_NUM" value="4" caption="--" />
              <param name="LVL_NUM" value="4" caption="--" />
              <param name="QOSCTRL_D_RESETVALUE" value="2" caption="--" />
              <param name="QOSCTRL_F_RESETVALUE" value="2" caption="--" />
              <param name="QOSCTRL_WRB_RESETVALUE" value="2" caption="--" />
              <param name="SPLIT_IRQ_NUM" value="4" caption="--" />
              <param name="TRIG_NUM" value="43" caption="--" />
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="1" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="21" caption="Instance index for DMAC" />
              <param name="MCLK_ID_AHB" value="28" caption="Index for DMAC AHB clock" />
              <param name="MCLK_ID_APB" value="29" caption="Index for DMAC APB clock" />
              <param name="PAC_ID" value="21" caption="Index for DMAC registers write protection" />
            </parameters>
          </instance>
        </module>
        <module name="DSU" id="04465" name2="icd_dsu_v1" version="1a0">
          <instance name="DSU">
            <register-group name="DSU" name-in-module="DSU" address-space="base" offset="0x44000000" />
            <signals>
              <signal group="MSA" function="DSU_MSA" pad="PC05" />
              <signal group="SWCCSTAT" function="DSU_SWCCSTAT" pad="PC06" />
            </signals>
            <parameters>
              <param name="DSU_BASE_ADDR_INTERNAL" value="0x44000000" caption="--" />
              <param name="DSU_CPU_NUM" value="0" caption="--" />
              <param name="DSU_TZ_IMPLEMENTED" value="1" caption="--" />
              <param name="DSU_CORESIGHT_REVISION" value="0x0" caption="--" />
              <param name="DSU_CORESIGHT_ENTRY" value="0xE00FF001 0x0 0x0 0x0" caption="--" />
              <param name="DSU_ID_MASKID" value="0x00" caption="Microchip Device Mask ID which provides the value for bits [15:8] of the ID - Part Number." />
              <param name="DSU_ID_VER" value="0x0" caption="ID Version Code provides the Mask Revision value for the device. Use metal changeable cells to configure this value." />
              <param name="DSU_SD_KEY" value="0xFFABAFD0" caption="--" />
              <param name="DSU_DCFG_MASK" value="0xFF0FFF0F 0x10FC7F80 0xC0800203 0x0 0x0 0x0 0x0 0x0" caption="--" />
              <param name="DSU_DAL1_VAL" value="0x55" caption="--" />
              <param name="DSU_DAL2_VAL" value="0xAA" caption="--" />
              <param name="DSU_CTRLAPRIV_IMPLEMENTED" value="1" caption="--" />
              <param name="DSU_CTRLB_IMPLEMENTED_MASK" value="0x00000000" caption="--" />
              <param name="DSU_WPCTRL_IMPLEMENTED" value="0" caption="--" />
              <param name="DSU_WPCTRL_KEY" value="0x445355" caption="--" />
              <param name="DSU_PRVKEY_IMPLEMENTED" value="0" caption="key sourced by PUF, not DSU" />
              <param name="DSU_BRCTRL_KEY" value="0x445355" caption="--" />
              <param name="DSU_TDID_DIE" value="0x00" caption="--" />
              <param name="DSU_TDID_MASK" value="0x00" caption="--" />
              <param name="DSU_SWCCS_IMPLEMENTED" value="1" caption="--" />
              <param name="DSU_TESTMODE_IMPLEMENTED_MASK" value="0x000007FF 0x00000000 0x00000000 0x00000000" caption="--" />
              <param name="DSU_FUSES_DATA_MSB" value="127" caption="128-bit bus" />
              <param name="DSU_FUSES_RDY_MSB" value="14" caption="15 bit fuse ready bus" />
              <param name="DSU_FUSES_ID_DEVID_START" value="24" caption="DEVID field is DSUCFG0[31:24]" />
              <param name="DSU_FUSES_ID_DEVID_SIZE" value="8" caption="--" />
              <param name="DSU_FUSES_ID_DEVID_ROWID" value="8" caption="DEVID on RowID Index = 8" />
              <param name="DSU_FUSES_DCFG_START" value="0 32 64 96 0 32 64 96" caption="--" />
              <param name="DSU_FUSES_DCFG_SIZE" value="32 32 32 32 32 32 32 32" caption="--" />
              <param name="DSU_FUSES_DCFG_ROWID" value="8 8 8 8 9 9 9 9" caption="DSUCFG7-0 = FCCFG39-32" />
              <param name="DMAC_ID_DCC0" value="1" />
              <param name="DMAC_ID_DCC1" value="2" />
              <param name="BRIDGE_ID" value="0" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="0" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="0" caption="Instance index for DSU" />
              <param name="MCLK_ID_AHB" value="0" caption="Index for DSU AHB clock" />
              <param name="PAC_ID" value="0" caption="Index for DSU registers write protection" />
            </parameters>
          </instance>
        </module>
        <module name="DWT" id="SYSTEM_IP" version="1.0.0">
          <instance name="DWT">
            <register-group name="DWT" name-in-module="DWT" address-space="base" offset="0xE0001000" />
            <parameters>
              <param name="__WPT_NUM" value="2" caption="Number of DWT watchpoint comparators" />
            </parameters>
          </instance>
        </module>
        <module name="EIC" id="03706" name2="int_eic_u2804_v1" version="1b0">
          <instance name="EIC">
            <register-group name="EIC" name-in-module="EIC" address-space="base" offset="0x44020000" />
            <signals>
              <signal group="EXTINT" index="0" function="A" pad="PA00" />
              <signal group="EXTINT" index="0" function="A" pad="PA16" />
              <signal group="EXTINT" index="0" function="A" pad="PB00" />
              <signal group="EXTINT" index="0" function="A" pad="PB15" />
              <signal group="EXTINT" index="0" function="A" pad="PC00" />
              <signal group="EXTINT" index="0" function="A" pad="PC16" />
              <signal group="EXTINT" index="0" function="A" pad="PD18" />
              <signal group="EXTINT" index="1" function="A" pad="PA01" />
              <signal group="EXTINT" index="1" function="A" pad="PA17" />
              <signal group="EXTINT" index="1" function="A" pad="PB01" />
              <signal group="EXTINT" index="1" function="A" pad="PB16" />
              <signal group="EXTINT" index="1" function="A" pad="PC01" />
              <signal group="EXTINT" index="1" function="A" pad="PC17" />
              <signal group="EXTINT" index="1" function="A" pad="PD01" />
              <signal group="EXTINT" index="1" function="A" pad="PD19" />
              <signal group="EXTINT" index="2" function="A" pad="PA02" />
              <signal group="EXTINT" index="2" function="A" pad="PA18" />
              <signal group="EXTINT" index="2" function="A" pad="PB02" />
              <signal group="EXTINT" index="2" function="A" pad="PB12" />
              <signal group="EXTINT" index="2" function="A" pad="PB17" />
              <signal group="EXTINT" index="2" function="A" pad="PC02" />
              <signal group="EXTINT" index="2" function="A" pad="PC18" />
              <signal group="EXTINT" index="2" function="A" pad="PD04" />
              <signal group="EXTINT" index="2" function="A" pad="PD20" />
              <signal group="EXTINT" index="3" function="A" pad="PA03" />
              <signal group="EXTINT" index="3" function="A" pad="PA19" />
              <signal group="EXTINT" index="3" function="A" pad="PB03" />
              <signal group="EXTINT" index="3" function="A" pad="PC03" />
              <signal group="EXTINT" index="3" function="A" pad="PC19" />
              <signal group="EXTINT" index="3" function="A" pad="PD05" />
              <signal group="EXTINT" index="4" function="A" pad="PA04" />
              <signal group="EXTINT" index="4" function="A" pad="PA20" />
              <signal group="EXTINT" index="4" function="A" pad="PB04" />
              <signal group="EXTINT" index="4" function="A" pad="PC04" />
              <signal group="EXTINT" index="4" function="A" pad="PD07" />
              <signal group="EXTINT" index="5" function="A" pad="PA05" />
              <signal group="EXTINT" index="5" function="A" pad="PB05" />
              <signal group="EXTINT" index="5" function="A" pad="PC05" />
              <signal group="EXTINT" index="5" function="A" pad="PD08" />
              <signal group="EXTINT" index="6" function="A" pad="PA06" />
              <signal group="EXTINT" index="6" function="A" pad="PB06" />
              <signal group="EXTINT" index="6" function="A" pad="PC06" />
              <signal group="EXTINT" index="6" function="A" pad="PD09" />
              <signal group="EXTINT" index="7" function="A" pad="PA07" />
              <signal group="EXTINT" index="8" function="A" pad="PA08" />
              <signal group="EXTINT" index="8" function="A" pad="PB07" />
              <signal group="EXTINT" index="8" function="A" pad="PD10" />
              <signal group="EXTINT" index="9" function="A" pad="PA09" />
              <signal group="EXTINT" index="9" function="A" pad="PB08" />
              <signal group="EXTINT" index="9" function="A" pad="PC09" />
              <signal group="EXTINT" index="9" function="A" pad="PD11" />
              <signal group="EXTINT" index="10" function="A" pad="PA10" />
              <signal group="EXTINT" index="10" function="A" pad="PB09" />
              <signal group="EXTINT" index="10" function="A" pad="PC10" />
              <signal group="EXTINT" index="10" function="A" pad="PD12" />
              <signal group="EXTINT" index="11" function="A" pad="PA11" />
              <signal group="EXTINT" index="11" function="A" pad="PB10" />
              <signal group="EXTINT" index="11" function="A" pad="PC11" />
              <signal group="EXTINT" index="11" function="A" pad="PD13" />
              <signal group="EXTINT" index="12" function="A" pad="PA12" />
              <signal group="EXTINT" index="12" function="A" pad="PB11" />
              <signal group="EXTINT" index="12" function="A" pad="PC12" />
              <signal group="EXTINT" index="12" function="A" pad="PD14" />
              <signal group="EXTINT" index="13" function="A" pad="PA13" />
              <signal group="EXTINT" index="13" function="A" pad="PC13" />
              <signal group="EXTINT" index="13" function="A" pad="PD15" />
              <signal group="EXTINT" index="14" function="A" pad="PA14" />
              <signal group="EXTINT" index="14" function="A" pad="PB13" />
              <signal group="EXTINT" index="14" function="A" pad="PC14" />
              <signal group="EXTINT" index="14" function="A" pad="PD16" />
              <signal group="EXTINT" index="15" function="A" pad="PA15" />
              <signal group="EXTINT" index="15" function="A" pad="PB14" />
              <signal group="EXTINT" index="15" function="A" pad="PC15" />
              <signal group="EXTINT" index="15" function="A" pad="PD17" />
              <signal group="NMI" function="A" pad="PD00" />
            </signals>
            <parameters>
              <param name="EXTINT_NUM" value="16" caption="--" />
              <param name="NUMBER_OF_CONFIG_REGS" value="2" caption="=(EIC_EXTINT_NUM +7) / 8" />
              <param name="NUMBER_OF_INTERRUPTS" value="16" caption="=(EIC_EXTINT_NUM)" />
              <param name="SECURE_IMPLEMENTED" value="1" caption="--" />
              <param name="GCLK_ID" value="5" />
              <param name="BRIDGE_ID" value="0" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="16" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="13" caption="Instance index for EIC" />
              <param name="MCLK_ID_APB" value="13" caption="Index for EIC APB clock" />
              <param name="PAC_ID" value="13" caption="Index for EIC registers write protection" />
            </parameters>
          </instance>
        </module>
        <module name="EVSYS" id="03601" name2="ptg_evsys_u2504_v2" version="2b0">
          <instance name="EVSYS">
            <register-group name="EVSYS" name-in-module="EVSYS" address-space="base" offset="0x44806000" />
            <parameters>
              <param name="ASYNCHRONOUS_CHANNELS" value="0xFFFFF000" caption="--" />
              <param name="CHANNELS" value="12" caption="--" />
              <param name="CHANNELS_BITS" value="4" caption="=LEN( BIN(EVSYS_CHANNELS-1)) - 2)derived parameter" />
              <param name="GENERATORS" value="90" caption="Should be 90" />
              <param name="GENERATORS_BITS" value="7" caption="=LEN( BIN(EVSYS_GENERATORS-1)) - 2)derived parameter" />
              <param name="SECURE_IMPLEMENTED" value="0" caption="--" />
              <param name="SPLIT_IRQ_NUM" value="12" caption="--" />
              <param name="SYNCH_NUM" value="12" caption="--" />
              <param name="SYNCH_NUM_BITS" value="4" caption="=LEN( BIN(EVSYS_SYNCH_NUM-1)) - 2)derived parameter" />
              <param name="USERS" value="62" caption="Should be 62" />
              <param name="USERS_BITS" value="6" caption="=LEN( BIN(EVSYS_USERS-1)) - 2)derived parameter" />
              <param name="USERS_GROUPS" value="2" caption="=(EVSYS_USERS+31) / 32derived parameter" />
              <param name="GCLK_ID_CH0" value="8" />
              <param name="GCLK_ID_CH1" value="9" />
              <param name="GCLK_ID_CH2" value="10" />
              <param name="GCLK_ID_CH3" value="11" />
              <param name="GCLK_ID_CH4" value="12" />
              <param name="GCLK_ID_CH5" value="13" />
              <param name="GCLK_ID_CH6" value="14" />
              <param name="GCLK_ID_CH7" value="15" />
              <param name="GCLK_ID_CH8" value="16" />
              <param name="GCLK_ID_CH9" value="17" />
              <param name="GCLK_ID_CH10" value="18" />
              <param name="GCLK_ID_CH11" value="19" />
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="3" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="25" caption="Instance index for EVSYS" />
              <param name="MCLK_ID_APB" value="35" caption="Index for EVSYS APB clock" />
              <param name="PAC_ID" value="25" caption="Index for EVSYS registers write protection" />
            </parameters>
          </instance>
        </module>
        <module name="FCR" id="04972" name2="pfm_ctrlr_apb_v2" version="2a0">
          <instance name="FCR">
            <register-group name="FCR" name-in-module="FCR" address-space="base" offset="0x44002000" />
