zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00100.atdf
          <instance name="SERCOM2">
            <register-group name="SERCOM2" name-in-module="SERCOM" address-space="base" offset="0x4480C000" />
            <signals>
              <signal group="PAD" index="0" function="D" pad="PC04" ioset="1" />
              <signal group="PAD" index="0" function="D" pad="PC19" ioset="2" />
              <signal group="PAD" index="1" function="D" pad="PC18" ioset="2" />
              <signal group="PAD" index="1" function="D" pad="PD06" ioset="1" />
              <signal group="PAD" index="2" function="D" pad="PC17" ioset="2" />
              <signal group="PAD" index="2" function="D" pad="PD07" ioset="1" />
              <signal group="PAD" index="3" function="D" pad="PC16" ioset="2" />
              <signal group="PAD" index="3" function="D" pad="PD08" ioset="1" />
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART" />
              <param name="DMA" value="1" caption="DMA support implemented?" />
              <param name="FIFO_IMPLEMENTED" value="1" caption="FIFO Rx/Tx implemented?" />
              <param name="FIFO_SIZE" value="16" caption="Rx-Tx FIFO size in bytes" />
              <param name="FSYNC_IMPLEMENTED" value="1" caption="SPI Frame Synch mode implemented?" />
              <param name="SPI" value="1" caption="SPI mode implemented?" />
              <param name="TWIM" value="1" caption="TWI Master mode implemented?" />
              <param name="TWIS" value="1" caption="TWI Slave mode implemented?" />
              <param name="TWI_HSMODE" value="0" caption="TWI HighSpeed mode implemented?" />
              <param name="ULTRA_IMPLEMENTATION" value="0" caption="ULTRA platform compatibility?" />
              <param name="USART" value="1" caption="USART mode implemented?" />
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?" />
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?" />
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?" />
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?" />
              <param name="GCLK_ID_SLOW" value="20" />
              <param name="GCLK_ID_CORE" value="23" />
              <param name="DMAC_ID_RX" value="8" />
              <param name="DMAC_ID_TX" value="9" />
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="6" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="28" caption="Instance index for SERCOM2" />
              <param name="MCLK_ID_APB" value="38" caption="Index for SERCOM2 APB clock" />
              <param name="PAC_ID" value="28" caption="Index for SERCOM2 registers write protection" />
            </parameters>
          </instance>
          <instance name="SERCOM3">
            <register-group name="SERCOM3" name-in-module="SERCOM" address-space="base" offset="0x4480E000" />
            <signals>
              <signal group="PAD" index="0" function="D" pad="PD16" ioset="2" />
              <signal group="PAD" index="0" function="D" pad="PD09" ioset="1" />
              <signal group="PAD" index="1" function="D" pad="PA00" ioset="1" />
              <signal group="PAD" index="1" function="D" pad="PD15" ioset="2" />
              <signal group="PAD" index="2" function="D" pad="PA01" ioset="1" />
              <signal group="PAD" index="2" function="D" pad="PD17" ioset="2" />
              <signal group="PAD" index="3" function="D" pad="PA02" ioset="1" />
              <signal group="PAD" index="3" function="D" pad="PD14" ioset="2" />
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART" />
              <param name="DMA" value="1" caption="DMA support implemented?" />
              <param name="FIFO_IMPLEMENTED" value="1" caption="FIFO Rx/Tx implemented?" />
              <param name="FIFO_SIZE" value="16" caption="Rx-Tx FIFO size in bytes" />
              <param name="FSYNC_IMPLEMENTED" value="1" caption="SPI Frame Synch mode implemented?" />
              <param name="SPI" value="1" caption="SPI mode implemented?" />
              <param name="TWIM" value="1" caption="TWI Master mode implemented?" />
              <param name="TWIS" value="1" caption="TWI Slave mode implemented?" />
              <param name="TWI_HSMODE" value="0" caption="TWI HighSpeed mode implemented?" />
              <param name="ULTRA_IMPLEMENTATION" value="0" caption="ULTRA platform compatibility?" />
              <param name="USART" value="1" caption="USART mode implemented?" />
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?" />
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?" />
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?" />
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?" />
              <param name="GCLK_ID_SLOW" value="20" />
              <param name="GCLK_ID_CORE" value="24" />
              <param name="DMAC_ID_RX" value="10" />
              <param name="DMAC_ID_TX" value="11" />
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="7" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="29" caption="Instance index for SERCOM3" />
              <param name="MCLK_ID_APB" value="39" caption="Index for SERCOM3 APB clock" />
              <param name="PAC_ID" value="29" caption="Index for SERCOM3 registers write protection" />
            </parameters>
          </instance>
          <instance name="SERCOM4">
            <register-group name="SERCOM4" name-in-module="SERCOM" address-space="base" offset="0x44820000" />
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA03" ioset="1" />
              <signal group="PAD" index="0" function="D" pad="PD19" ioset="2" />
              <signal group="PAD" index="1" function="D" pad="PA04" ioset="1" />
              <signal group="PAD" index="1" function="D" pad="PD20" ioset="2" />
              <signal group="PAD" index="2" function="D" pad="PA05" ioset="1" />
              <signal group="PAD" index="2" function="D" pad="PD18" ioset="2" />
              <signal group="PAD" index="3" function="D" pad="PA14" ioset="2" />
              <signal group="PAD" index="3" function="D" pad="PA06" ioset="1" />
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART" />
              <param name="DMA" value="1" caption="DMA support implemented?" />
              <param name="FIFO_IMPLEMENTED" value="1" caption="FIFO Rx/Tx implemented?" />
              <param name="FIFO_SIZE" value="16" caption="Rx-Tx FIFO size in bytes" />
              <param name="FSYNC_IMPLEMENTED" value="1" caption="SPI Frame Synch mode implemented?" />
              <param name="SPI" value="1" caption="SPI mode implemented?" />
              <param name="TWIM" value="0" caption="TWI Master mode implemented?" />
              <param name="TWIS" value="0" caption="TWI Slave mode implemented?" />
              <param name="TWI_HSMODE" value="0" caption="TWI HighSpeed mode implemented?" />
              <param name="ULTRA_IMPLEMENTATION" value="0" caption="ULTRA platform compatibility?" />
              <param name="USART" value="1" caption="USART mode implemented?" />
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?" />
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?" />
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?" />
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?" />
              <param name="GCLK_ID_CORE" value="28" />
              <param name="DMAC_ID_RX" value="24" />
              <param name="DMAC_ID_TX" value="25" />
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="16" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="34" caption="Instance index for SERCOM4" />
              <param name="MCLK_ID_APB" value="44" caption="Index for SERCOM4 APB clock" />
              <param name="PAC_ID" value="34" caption="Index for SERCOM4 registers write protection" />
            </parameters>
          </instance>
          <instance name="SERCOM5">
            <register-group name="SERCOM5" name-in-module="SERCOM" address-space="base" offset="0x44822000" />
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA16" ioset="2" />
              <signal group="PAD" index="0" function="D" pad="PB03" ioset="1" />
              <signal group="PAD" index="1" function="D" pad="PA17" ioset="2" />
              <signal group="PAD" index="1" function="D" pad="PB04" ioset="1" />
              <signal group="PAD" index="2" function="D" pad="PA18" ioset="2" />
              <signal group="PAD" index="2" function="D" pad="PB05" ioset="1" />
              <signal group="PAD" index="3" function="D" pad="PA15" ioset="2" />
              <signal group="PAD" index="3" function="D" pad="PB06" ioset="1" />
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART" />
              <param name="DMA" value="1" caption="DMA support implemented?" />
              <param name="FIFO_IMPLEMENTED" value="1" caption="FIFO Rx/Tx implemented?" />
              <param name="FIFO_SIZE" value="16" caption="Rx-Tx FIFO size in bytes" />
              <param name="FSYNC_IMPLEMENTED" value="1" caption="SPI Frame Synch mode implemented?" />
              <param name="SPI" value="1" caption="SPI mode implemented?" />
              <param name="TWIM" value="0" caption="TWI Master mode implemented?" />
              <param name="TWIS" value="0" caption="TWI Slave mode implemented?" />
              <param name="TWI_HSMODE" value="0" caption="TWI HighSpeed mode implemented?" />
              <param name="ULTRA_IMPLEMENTATION" value="0" caption="ULTRA platform compatibility?" />
              <param name="USART" value="1" caption="USART mode implemented?" />
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?" />
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?" />
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?" />
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?" />
              <param name="GCLK_ID_CORE" value="29" />
              <param name="DMAC_ID_RX" value="26" />
              <param name="DMAC_ID_TX" value="27" />
              <param name="BRIDGE_ID" value="1" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="17" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="35" caption="Instance index for SERCOM5" />
              <param name="MCLK_ID_APB" value="45" caption="Index for SERCOM5 APB clock" />
              <param name="PAC_ID" value="35" caption="Index for SERCOM5 registers write protection" />
            </parameters>
          </instance>
        </module>
        <module name="SUPC" id="03926" name2="pwr_rpmu_supc_v1" version="1c0">
          <instance name="SUPC">
            <register-group name="SUPC" name-in-module="SUPC" address-space="base" offset="0x45002000" />
            <signals>
              <signal group="RESETn" function="RES" pad="RESET_N" />
              <signal group="SMOR_DTEST" index="0" function="SUPC_VREF_TESTMODE" pad="PD08" />
              <signal group="SMOR_DTEST" index="1" function="SUPC_VREF_TESTMODE" pad="PD09" />
              <signal group="SMOR_DTEST" index="2" function="SUPC_VREF_TESTMODE" pad="PD07" />
              <signal group="SMOR_DTEST" index="3" function="SUPC_VREF_TESTMODE" pad="PA00" />
              <signal group="SMOR_DTEST" index="4" function="SUPC_VREF_TESTMODE" pad="PA01" />
              <signal group="SMOR_DTEST" index="5" function="SUPC_VREF_TESTMODE" pad="PA02" />
              <signal group="SMOR_DTEST" index="6" function="SUPC_VREF_TESTMODE" pad="PA03" />
              <signal group="SMOR_DTEST" index="7" function="SUPC_VREF_TESTMODE" pad="PA04" />
              <signal group="SMOR_DTEST" index="8" function="SUPC_VREF_TESTMODE" pad="PB03" />
              <signal group="SMOR_DTEST" index="9" function="SUPC_VREF_TESTMODE" pad="PB04" />
              <signal group="SMOR_DTEST" index="10" function="SUPC_VREF_TESTMODE" pad="PB05" />
              <signal group="SMOR_DTEST" index="11" function="SUPC_VREF_TESTMODE" pad="PB06" />
              <signal group="SMOR_DTEST" index="12" function="SUPC_VREF_TESTMODE" pad="PC00" />
              <signal group="SMOR_DTEST" index="13" function="SUPC_VREF_TESTMODE" pad="PA06" />
              <signal group="SMOR_DTEST" index="14" function="SUPC_VREF_TESTMODE" pad="PA07" />
              <signal group="SMOR_DTEST" index="15" function="SUPC_VREF_TESTMODE" pad="PC03" />
              <signal group="OUT" index="0" function="SUPC" pad="PB04" />
              <signal group="OUT" index="1" function="SUPC" pad="PB05" />
              <signal group="USERLDO" function="USER_LDO" pad="PD06" />
              <signal group="USERLDO_OUT" function="USER_LDO_OP_AMP" pad="USERLDO" />
            </signals>
            <parameters>
              <param name="ADDVREG_NUM" value="1" caption="Jira PWR109-210" />
              <param name="ADDVREG_PLL_NUM" value="0" caption="--" />
              <param name="ADDVREG_PLL_START_INDEX" value="1" caption="--" />
              <param name="BKOUT_NUM" value="2" caption="--" />
              <param name="BORVDDUSB_NUM" value="1" caption="(Jira PWR109-219)" />
              <param name="CHRG_PUMP_NUM" value="2" caption="--" />
              <param name="IOB_IMPLEMENTED" value="0" caption="--" />
              <param name="USER_LDO_IMPLEMENTED" value="1" caption="--" />
              <param name="VBAT_IMPLEMENTED" value="0" caption="--" />
              <param name="VREGSW_NUM" value="1" caption="--" />
              <param name="BRIDGE_ID" value="2" caption="H2PB Bridge ID" />
              <param name="PERIPH_ID" value="1" caption="H2PB Peripheral ID" />
              <param name="INSTANCE_ID" value="4" caption="Instance index for SUPC" />
              <param name="MCLK_ID_APB" value="4" caption="Index for SUPC APB clock" />
              <param name="PAC_ID" value="4" caption="Index for SUPC registers write protection" />
            </parameters>
          </instance>
        </module>
        <module name="SysTick" id="SYSTEM_IP" version="1.0.0">
          <instance name="SysTick">
            <register-group name="SysTick" name-in-module="SysTick" address-space="base" offset="0xE000E010" />
