zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00100.atdf
      </peripherals>
      <interrupts>
        <interrupt name="Reset" index="-15" caption="Reset Vector, invoked on Power up and warm reset" />
        <interrupt name="NonMaskableInt" index="-14" caption="Non maskable Interrupt, cannot be stopped or preempted" />
        <interrupt name="HardFault" index="-13" caption="Hard Fault, all classes of Fault" />
        <interrupt name="SVCall" index="-5" caption="System Service Call via SVC instruction" />
        <interrupt name="PendSV" index="-2" caption="Pendable request for system service" />
        <interrupt name="SysTick" index="-1" caption="System Tick Timer" />
        <interrupt name="FCR" index="0" module-instance="FCR" />
        <interrupt name="FCW" index="1" module-instance="FCW" />
        <interrupt name="PM" index="2" module-instance="PM" />
        <interrupt name="SUPC" index="3" module-instance="SUPC" />
        <interrupt name="OSCCTRL_XOSCRDY" index="4" module-instance="OSCCTRL" />
        <interrupt name="OSCCTRL_DFLLRDY" index="5" module-instance="OSCCTRL" />
        <interrupt name="OSCCTRL_PLLLOCKR_0" index="6" module-instance="OSCCTRL" />
        <interrupt name="OSC32KCTRL_XOSC32KRDY" index="7" module-instance="OSC32KCTRL" />
        <interrupt name="OSC32KCTRL_XOSC32KFAIL" index="8" module-instance="OSC32KCTRL" />
        <interrupt name="MCLK" index="9" module-instance="MCLK" />
        <interrupt name="FREQM" index="10" module-instance="FREQM" />
        <interrupt name="WDT" index="11" module-instance="WDT" />
        <interrupt name="RTC_TAMPER" index="12" module-instance="RTC" />
        <interrupt name="RTC_OVF" index="13" module-instance="RTC" />
        <interrupt name="RTC_PER0" index="14" module-instance="RTC" />
        <interrupt name="RTC_CMP0" index="15" module-instance="RTC" />
        <interrupt name="EIC_EXTINT0" index="16" module-instance="EIC" />
        <interrupt name="EIC_EXTINT1" index="17" module-instance="EIC" />
        <interrupt name="EIC_EXTINT2" index="18" module-instance="EIC" />
        <interrupt name="EIC_EXTINT3" index="19" module-instance="EIC" />
        <interrupt name="EIC_EXTINT4" index="20" module-instance="EIC" />
        <interrupt name="EIC_EXTINT5" index="21" module-instance="EIC" />
        <interrupt name="EIC_EXTINT6" index="22" module-instance="EIC" />
        <interrupt name="EIC_EXTINT7" index="23" module-instance="EIC" />
        <interrupt name="EIC_EXTINT8" index="24" module-instance="EIC" />
        <interrupt name="EIC_EXTINT9" index="25" module-instance="EIC" />
        <interrupt name="EIC_EXTINT10" index="26" module-instance="EIC" />
        <interrupt name="EIC_EXTINT11" index="27" module-instance="EIC" />
        <interrupt name="EIC_EXTINT12" index="28" module-instance="EIC" />
        <interrupt name="EIC_EXTINT13" index="29" module-instance="EIC" />
        <interrupt name="EIC_EXTINT14" index="30" module-instance="EIC" />
        <interrupt name="EIC_EXTINT15" index="31" module-instance="EIC" />
        <interrupt name="EIC_NSCHK" index="32" module-instance="EIC" />
        <interrupt name="TRAM" index="33" module-instance="TRAM" />
        <interrupt name="MCRAMC" index="34" module-instance="MCRAMC" />
        <interrupt name="CAN0_INT0" index="35" module-instance="CAN0" />
        <interrupt name="CAN0_INT1" index="36" module-instance="CAN0" />
        <interrupt name="CAN0_BERR" index="37" module-instance="CAN0" />
        <interrupt name="CAN1_INT0" index="38" module-instance="CAN1" />
        <interrupt name="CAN1_INT1" index="39" module-instance="CAN1" />
        <interrupt name="CAN1_BERR" index="40" module-instance="CAN1" />
        <interrupt name="PORT" index="41" module-instance="PORT" />
        <interrupt name="DMAC_TCMPL0" index="42" module-instance="DMAC" />
        <interrupt name="DMAC_TCMPL1" index="43" module-instance="DMAC" />
        <interrupt name="DMAC_TCMPL2" index="44" module-instance="DMAC" />
        <interrupt name="DMAC_TCMPL3" index="45" module-instance="DMAC" />
        <interrupt name="DMAC_TCMPL4" index="46" module-instance="DMAC" />
        <interrupt name="HMATRIX2" index="47" module-instance="HMATRIX2" />
        <interrupt name="EVSYS_EVD0" index="48" module-instance="EVSYS" />
        <interrupt name="EVSYS_EVD1" index="49" module-instance="EVSYS" />
        <interrupt name="EVSYS_EVD2" index="50" module-instance="EVSYS" />
        <interrupt name="EVSYS_EVD3" index="51" module-instance="EVSYS" />
        <interrupt name="EVSYS_EVD4" index="52" module-instance="EVSYS" />
        <interrupt name="EVSYS_EVD5" index="53" module-instance="EVSYS" />
        <interrupt name="EVSYS_EVD6" index="54" module-instance="EVSYS" />
        <interrupt name="EVSYS_EVD7" index="55" module-instance="EVSYS" />
        <interrupt name="EVSYS_EVD8" index="56" module-instance="EVSYS" />
        <interrupt name="EVSYS_EVD9" index="57" module-instance="EVSYS" />
        <interrupt name="EVSYS_EVD10" index="58" module-instance="EVSYS" />
        <interrupt name="EVSYS_EVD11" index="59" module-instance="EVSYS" />
        <interrupt name="SERCOM0_6" index="60" module-instance="SERCOM0" />
        <interrupt name="SERCOM0_5" index="61" module-instance="SERCOM0" />
        <interrupt name="SERCOM0_0" index="62" module-instance="SERCOM0" />
        <interrupt name="SERCOM0_1" index="63" module-instance="SERCOM0" />
        <interrupt name="SERCOM0_2" index="64" module-instance="SERCOM0" />
        <interrupt name="SERCOM0_3" index="65" module-instance="SERCOM0" />
        <interrupt name="SERCOM0_4" index="66" module-instance="SERCOM0" />
        <interrupt name="SERCOM1_6" index="67" module-instance="SERCOM1" />
        <interrupt name="SERCOM1_5" index="68" module-instance="SERCOM1" />
        <interrupt name="SERCOM1_0" index="69" module-instance="SERCOM1" />
        <interrupt name="SERCOM1_1" index="70" module-instance="SERCOM1" />
        <interrupt name="SERCOM1_2" index="71" module-instance="SERCOM1" />
        <interrupt name="SERCOM1_3" index="72" module-instance="SERCOM1" />
        <interrupt name="SERCOM1_4" index="73" module-instance="SERCOM1" />
        <interrupt name="SERCOM2_6" index="74" module-instance="SERCOM2" />
        <interrupt name="SERCOM2_5" index="75" module-instance="SERCOM2" />
        <interrupt name="SERCOM2_0" index="76" module-instance="SERCOM2" />
        <interrupt name="SERCOM2_1" index="77" module-instance="SERCOM2" />
        <interrupt name="SERCOM2_2" index="78" module-instance="SERCOM2" />
        <interrupt name="SERCOM2_3" index="79" module-instance="SERCOM2" />
        <interrupt name="SERCOM2_4" index="80" module-instance="SERCOM2" />
        <interrupt name="SERCOM3_6" index="81" module-instance="SERCOM3" />
        <interrupt name="SERCOM3_5" index="82" module-instance="SERCOM3" />
        <interrupt name="SERCOM3_0" index="83" module-instance="SERCOM3" />
        <interrupt name="SERCOM3_1" index="84" module-instance="SERCOM3" />
        <interrupt name="SERCOM3_2" index="85" module-instance="SERCOM3" />
        <interrupt name="SERCOM3_3" index="86" module-instance="SERCOM3" />
        <interrupt name="SERCOM3_4" index="87" module-instance="SERCOM3" />
        <interrupt name="TCC0_DFS" index="88" module-instance="TCC0" />
        <interrupt name="TCC0_CNT" index="89" module-instance="TCC0" />
        <interrupt name="TCC0_MC0" index="90" module-instance="TCC0" />
        <interrupt name="TCC0_MC1" index="91" module-instance="TCC0" />
        <interrupt name="TCC1_DFS" index="92" module-instance="TCC1" />
        <interrupt name="TCC1_CNT" index="93" module-instance="TCC1" />
        <interrupt name="TCC1_MC0" index="94" module-instance="TCC1" />
        <interrupt name="TCC1_MC1" index="95" module-instance="TCC1" />
        <interrupt name="TCC2_DFS" index="96" module-instance="TCC2" />
        <interrupt name="TCC2_CNT" index="97" module-instance="TCC2" />
        <interrupt name="TCC2_MC0" index="98" module-instance="TCC2" />
        <interrupt name="TCC2_MC1" index="99" module-instance="TCC2" />
        <interrupt name="TCC3_DFS" index="100" module-instance="TCC3" />
        <interrupt name="TCC3_CNT" index="101" module-instance="TCC3" />
        <interrupt name="TCC3_MC0" index="102" module-instance="TCC3" />
        <interrupt name="TCC3_MC1" index="103" module-instance="TCC3" />
        <interrupt name="SERCOM4_6" index="104" module-instance="SERCOM4" />
        <interrupt name="SERCOM4_5" index="105" module-instance="SERCOM4" />
        <interrupt name="SERCOM4_0" index="106" module-instance="SERCOM4" />
        <interrupt name="SERCOM4_1" index="107" module-instance="SERCOM4" />
        <interrupt name="SERCOM4_2" index="108" module-instance="SERCOM4" />
        <interrupt name="SERCOM4_3" index="109" module-instance="SERCOM4" />
        <interrupt name="SERCOM4_4" index="110" module-instance="SERCOM4" />
        <interrupt name="SERCOM5_6" index="111" module-instance="SERCOM5" />
        <interrupt name="SERCOM5_5" index="112" module-instance="SERCOM5" />
        <interrupt name="SERCOM5_0" index="113" module-instance="SERCOM5" />
        <interrupt name="SERCOM5_1" index="114" module-instance="SERCOM5" />
        <interrupt name="SERCOM5_2" index="115" module-instance="SERCOM5" />
        <interrupt name="SERCOM5_3" index="116" module-instance="SERCOM5" />
        <interrupt name="SERCOM5_4" index="117" module-instance="SERCOM5" />
        <interrupt name="TCC4_DFS" index="118" module-instance="TCC4" />
        <interrupt name="TCC4_CNT" index="119" module-instance="TCC4" />
        <interrupt name="TCC4_MC0" index="120" module-instance="TCC4" />
        <interrupt name="TCC4_MC1" index="121" module-instance="TCC4" />
        <interrupt name="TCC5_DFS" index="122" module-instance="TCC5" />
        <interrupt name="TCC5_CNT" index="123" module-instance="TCC5" />
        <interrupt name="TCC5_MC0" index="124" module-instance="TCC5" />
        <interrupt name="TCC5_MC1" index="125" module-instance="TCC5" />
        <interrupt name="TCC6_DFS" index="126" module-instance="TCC6" />
        <interrupt name="TCC6_CNT" index="127" module-instance="TCC6" />
        <interrupt name="TCC6_MC0" index="128" module-instance="TCC6" />
        <interrupt name="TCC6_MC1" index="129" module-instance="TCC6" />
        <interrupt name="ADC_REQ0" index="130" module-instance="ADC" />
        <interrupt name="ADC_REQ1" index="131" module-instance="ADC" />
        <interrupt name="AC" index="132" module-instance="AC" />
        <interrupt name="PTC" index="133" module-instance="PTC" />
        <interrupt name="USB_EORSMDNRSM" index="134" module-instance="USB" />
        <interrupt name="USB_SOFHSOF" index="135" module-instance="USB" />
        <interrupt name="USB_TRCPT00" index="136" module-instance="USB" />
        <interrupt name="USB_TRCPT10" index="137" module-instance="USB" />
        <interrupt name="AT" index="138" module-instance="AT" />
        <interrupt name="HSM" index="139" module-instance="HSM" />
        <interrupt name="PUF" index="140" module-instance="PUF" />
      </interrupts>
      <events>
        <generators>
          <generator name="SUPC_LVDET" index="1" module-instance="SUPC" />
          <generator name="OSCCTRL_XOSCFAIL" index="2" module-instance="OSCCTRL" />
          <generator name="OSC32KCTRL_XOSC32KFAIL" index="3" module-instance="OSC32KCTRL" />
          <generator name="FREQM_DONE" index="4" module-instance="FREQM" />
          <generator name="FREQM_WINMON" index="5" module-instance="FREQM" />
          <generator name="RTC_PER0" index="6" module-instance="RTC" />
          <generator name="RTC_PER1" index="7" module-instance="RTC" />
          <generator name="RTC_PER2" index="8" module-instance="RTC" />
          <generator name="RTC_PER3" index="9" module-instance="RTC" />
          <generator name="RTC_PER4" index="10" module-instance="RTC" />
          <generator name="RTC_PER5" index="11" module-instance="RTC" />
          <generator name="RTC_PER6" index="12" module-instance="RTC" />
          <generator name="RTC_PER7" index="13" module-instance="RTC" />
          <generator name="RTC_CMP0" index="14" module-instance="RTC" />
          <generator name="RTC_CMP1" index="15" module-instance="RTC" />
          <generator name="RTC_CMP2" index="16" module-instance="RTC" />
          <generator name="RTC_CMP3" index="17" module-instance="RTC" />
          <generator name="RTC_TAMPER" index="18" module-instance="RTC" />
          <generator name="RTC_OVF" index="19" module-instance="RTC" />
          <generator name="RTC_PERD" index="20" module-instance="RTC" />
          <generator name="EIC_EXTINT0" index="21" module-instance="EIC" />
          <generator name="EIC_EXTINT1" index="22" module-instance="EIC" />
          <generator name="EIC_EXTINT2" index="23" module-instance="EIC" />
          <generator name="EIC_EXTINT3" index="24" module-instance="EIC" />
          <generator name="EIC_EXTINT4" index="25" module-instance="EIC" />
          <generator name="EIC_EXTINT5" index="26" module-instance="EIC" />
          <generator name="EIC_EXTINT6" index="27" module-instance="EIC" />
          <generator name="EIC_EXTINT7" index="28" module-instance="EIC" />
          <generator name="EIC_EXTINT8" index="29" module-instance="EIC" />
          <generator name="EIC_EXTINT9" index="30" module-instance="EIC" />
          <generator name="EIC_EXTINT10" index="31" module-instance="EIC" />
          <generator name="EIC_EXTINT11" index="32" module-instance="EIC" />
          <generator name="EIC_EXTINT12" index="33" module-instance="EIC" />
          <generator name="EIC_EXTINT13" index="34" module-instance="EIC" />
          <generator name="EIC_EXTINT14" index="35" module-instance="EIC" />
          <generator name="EIC_EXTINT15" index="36" module-instance="EIC" />
          <generator name="DMAC_CH0" index="37" module-instance="DMAC" />
          <generator name="DMAC_CH1" index="38" module-instance="DMAC" />
          <generator name="DMAC_CH2" index="39" module-instance="DMAC" />
          <generator name="DMAC_CH3" index="40" module-instance="DMAC" />
          <generator name="TCC0_OVF" index="41" module-instance="TCC0" />
          <generator name="TCC0_TRG" index="42" module-instance="TCC0" />
          <generator name="TCC0_CNT" index="43" module-instance="TCC0" />
          <generator name="TCC0_MC0" index="44" module-instance="TCC0" />
          <generator name="TCC0_MC1" index="45" module-instance="TCC0" />
          <generator name="TCC1_OVF" index="46" module-instance="TCC1" />
          <generator name="TCC1_TRG" index="47" module-instance="TCC1" />
          <generator name="TCC1_CNT" index="48" module-instance="TCC1" />
          <generator name="TCC1_MC0" index="49" module-instance="TCC1" />
          <generator name="TCC1_MC1" index="50" module-instance="TCC1" />
          <generator name="TCC2_OVF" index="51" module-instance="TCC2" />
          <generator name="TCC2_TRG" index="52" module-instance="TCC2" />
          <generator name="TCC2_CNT" index="53" module-instance="TCC2" />
          <generator name="TCC2_MC0" index="54" module-instance="TCC2" />
          <generator name="TCC2_MC1" index="55" module-instance="TCC2" />
          <generator name="TCC3_OVF" index="56" module-instance="TCC3" />
          <generator name="TCC3_TRG" index="57" module-instance="TCC3" />
          <generator name="TCC3_CNT" index="58" module-instance="TCC3" />
          <generator name="TCC3_MC0" index="59" module-instance="TCC3" />
          <generator name="TCC3_MC1" index="60" module-instance="TCC3" />
          <generator name="TCC4_OVF" index="61" module-instance="TCC4" />
          <generator name="TCC4_TRG" index="62" module-instance="TCC4" />
          <generator name="TCC4_CNT" index="63" module-instance="TCC4" />
          <generator name="TCC4_MC0" index="64" module-instance="TCC4" />
          <generator name="TCC4_MC1" index="65" module-instance="TCC4" />
          <generator name="TCC5_OVF" index="66" module-instance="TCC5" />
          <generator name="TCC5_TRG" index="67" module-instance="TCC5" />
          <generator name="TCC5_CNT" index="68" module-instance="TCC5" />
          <generator name="TCC5_MC0" index="69" module-instance="TCC5" />
          <generator name="TCC5_MC1" index="70" module-instance="TCC5" />
          <generator name="TCC6_OVF" index="71" module-instance="TCC6" />
          <generator name="TCC6_TRG" index="72" module-instance="TCC6" />
          <generator name="TCC6_CNT" index="73" module-instance="TCC6" />
          <generator name="TCC6_MC0" index="74" module-instance="TCC6" />
          <generator name="TCC6_MC1" index="75" module-instance="TCC6" />
          <generator name="ADC_CHRDY" index="76" module-instance="ADC" />
          <generator name="ADC_CMP" index="77" module-instance="ADC" />
          <generator name="AC_COMP0" index="78" module-instance="AC" />
          <generator name="AC_COMP1" index="79" module-instance="AC" />
          <generator name="AC_WIN0" index="80" module-instance="AC" />
          <generator name="PTC_EOC" index="81" module-instance="PTC" />
          <generator name="PTC_WCOMP" index="82" module-instance="PTC" />
          <generator name="CCL0_LUTOUT0" index="83" module-instance="CCL0" />
          <generator name="CCL0_LUTOUT1" index="84" module-instance="CCL0" />
          <generator name="CCL0_LUTOUT2" index="85" module-instance="CCL0" />
          <generator name="CCL0_LUTOUT3" index="86" module-instance="CCL0" />
          <generator name="CCL1_LUTOUT0" index="87" module-instance="CCL1" />
          <generator name="CCL1_LUTOUT1" index="88" module-instance="CCL1" />
          <generator name="CCL1_LUTOUT2" index="89" module-instance="CCL1" />
          <generator name="CCL1_LUTOUT3" index="90" module-instance="CCL1" />
        </generators>
        <users>
          <user name="FREQM_START" index="0" module-instance="FREQM" />
          <user name="RTC_TAMPER" index="1" module-instance="RTC" />
          <user name="PORT_EV0" index="2" module-instance="PORT" />
          <user name="PORT_EV1" index="3" module-instance="PORT" />
          <user name="PORT_EV2" index="4" module-instance="PORT" />
          <user name="PORT_EV3" index="5" module-instance="PORT" />
          <user name="DMAC_CH0" index="6" module-instance="DMAC" />
          <user name="DMAC_CH1" index="7" module-instance="DMAC" />
          <user name="DMAC_CH2" index="8" module-instance="DMAC" />
          <user name="DMAC_CH3" index="9" module-instance="DMAC" />
          <user name="TCC0_EV0" index="10" module-instance="TCC0" />
          <user name="TCC0_EV1" index="11" module-instance="TCC0" />
          <user name="TCC0_MC0" index="12" module-instance="TCC0" />
          <user name="TCC0_MC1" index="13" module-instance="TCC0" />
          <user name="TCC1_EV0" index="14" module-instance="TCC1" />
          <user name="TCC1_EV1" index="15" module-instance="TCC1" />
          <user name="TCC1_MC0" index="16" module-instance="TCC1" />
          <user name="TCC1_MC1" index="17" module-instance="TCC1" />
          <user name="TCC2_EV0" index="18" module-instance="TCC2" />
          <user name="TCC2_EV1" index="19" module-instance="TCC2" />
          <user name="TCC2_MC0" index="20" module-instance="TCC2" />
          <user name="TCC2_MC1" index="21" module-instance="TCC2" />
          <user name="TCC3_EV0" index="22" module-instance="TCC3" />
          <user name="TCC3_EV1" index="23" module-instance="TCC3" />
          <user name="TCC3_MC0" index="24" module-instance="TCC3" />
          <user name="TCC3_MC1" index="25" module-instance="TCC3" />
          <user name="TCC4_EV0" index="26" module-instance="TCC4" />
          <user name="TCC4_EV1" index="27" module-instance="TCC4" />
          <user name="TCC4_MC0" index="28" module-instance="TCC4" />
          <user name="TCC4_MC1" index="29" module-instance="TCC4" />
          <user name="TCC5_EV0" index="30" module-instance="TCC5" />
          <user name="TCC5_EV1" index="31" module-instance="TCC5" />
          <user name="TCC5_MC0" index="32" module-instance="TCC5" />
          <user name="TCC5_MC1" index="33" module-instance="TCC5" />
          <user name="TCC6_EV0" index="34" module-instance="TCC6" />
          <user name="TCC6_EV1" index="35" module-instance="TCC6" />
          <user name="TCC6_MC0" index="36" module-instance="TCC6" />
          <user name="TCC6_MC1" index="37" module-instance="TCC6" />
          <user name="ADC_TRIG0" index="38" module-instance="ADC" />
          <user name="ADC_TRIG1" index="39" module-instance="ADC" />
          <user name="ADC_TRIG2" index="40" module-instance="ADC" />
          <user name="ADC_TRIG3" index="41" module-instance="ADC" />
          <user name="ADC_TRIG4" index="42" module-instance="ADC" />
          <user name="ADC_TRIG5" index="43" module-instance="ADC" />
          <user name="ADC_TRIG6" index="44" module-instance="ADC" />
          <user name="ADC_TRIG7" index="45" module-instance="ADC" />
          <user name="ADC_TRIG8" index="46" module-instance="ADC" />
          <user name="ADC_TRIG9" index="47" module-instance="ADC" />
          <user name="ADC_TRIG10" index="48" module-instance="ADC" />
          <user name="AC_SOC0" index="49" module-instance="AC" />
          <user name="AC_SOC1" index="50" module-instance="AC" />
          <user name="PTC_DSEQR" index="51" module-instance="PTC" />
          <user name="PTC_STCONV" index="52" module-instance="PTC" />
          <user name="CCL0_LUTIN0" index="53" module-instance="CCL0" />
          <user name="CCL0_LUTIN1" index="54" module-instance="CCL0" />
          <user name="CCL0_LUTIN2" index="55" module-instance="CCL0" />
          <user name="CCL0_LUTIN3" index="56" module-instance="CCL0" />
          <user name="CCL1_LUTIN0" index="57" module-instance="CCL1" />
          <user name="CCL1_LUTIN1" index="58" module-instance="CCL1" />
          <user name="CCL1_LUTIN2" index="59" module-instance="CCL1" />
          <user name="CCL1_LUTIN3" index="60" module-instance="CCL1" />
          <user name="AT_TAMPSRC5" index="61" module-instance="AT" />
        </users>
      </events>
      <interfaces>
        <interface name="JTAG" type="samjtag" />
        <interface name="SWD" type="swd" />
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="DSU_DID" value="0x0AC08053" />
        </property-group>
      </property-groups>
    </device>
