zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00100.atdf
        <register name="SYNCBUSY" offset="0xE8" rw="R" size="4" initval="0x00000000" caption="CORE SYNC Busy Status Register">
          <bitfield name="SWRST" caption="Software Reset Sync Busy" mask="0x1" />
          <bitfield name="ENABLE" caption="Enable bit Sync Busy" mask="0x2" />
          <bitfield name="CTRLB" caption="CTRLB sync busy" mask="0x4" />
        </register>
        <register name="DMAINTENCLR" offset="0xF0" rw="RW" size="4" atomic-op="clear:DMAINTENCLR" initval="0x00000000" caption="DMA Interrupt Enable Clear">
          <bitfield name="RAF" caption="Ram Buffer A Full" mask="0xF" />
          <bitfield name="RBF" caption="Ram Buffer B Full" mask="0xF0" />
          <bitfield name="SOVFL" caption="Synchonizer Overflow" mask="0x10000" />
        </register>
        <register name="DMAINTSET" offset="0xF4" rw="RW" size="4" atomic-op="set:DMAINTSET" initval="0x00000000" caption="DMA Interrupt Enable Set">
          <bitfield name="RAF" caption="Ram Buffer A Full" mask="0xF" />
          <bitfield name="RBF" caption="Ram Buffer B Full" mask="0xF0" />
          <bitfield name="SOVFL" caption="Synchonizer Overflow" mask="0x10000" />
        </register>
        <register name="DMAINTFLAG" offset="0xF8" rw="RW" size="4" atomic-op="clear:DMAINTFLAG" initval="0x00000000" caption="DMA Interrupt Flag and Status">
          <bitfield name="RAF" caption="Ram Buffer A Full" mask="0xF" />
          <bitfield name="RBF" caption="Ram Buffer B Full" mask="0xF0" />
          <bitfield name="EAF" caption="Ram Buffer A Overflow Error" mask="0xF00" />
          <bitfield name="EBF" caption="Ram Buffer B Overflow Error" mask="0xF000" />
          <bitfield name="SOVFL" caption="Synchronizer overflow" mask="0x10000" />
          <bitfield name="DMAERR" caption="DMA Bus Error" mask="0x20000" />
        </register>
        <register name="CTLINTENSET" offset="0xFC" rw="RW" size="4" atomic-op="set:CTLINTENSET" initval="0x00000000" caption="CORE Controller Interrupt Enable Set">
          <bitfield name="CRRDY0" caption="Core 0 Ready" mask="0x1" />
          <bitfield name="VREFUPD" caption="VREF update" mask="0x40" />
          <bitfield name="VREFRDY" caption="VREF Ready" mask="0x80" />
          <bitfield name="PFFUNF" caption="APB FIFO Underflow" mask="0x100" />
          <bitfield name="PFFOVF" caption="APB FIFO Overflow" mask="0x200" />
          <bitfield name="PFFRDY" caption="APB FIFO Ready" mask="0x400" />
          <bitfield name="PFFHFUL" caption="APB FIFO Half Full" mask="0x800" />
        </register>
        <register name="CTLINTENCLR" offset="0x100" rw="RW" size="4" atomic-op="clear:CTLINTENCLR" initval="0x00000000" caption="CORE Controller Interrupt Enable Clear">
          <bitfield name="CRRDY0" caption="Core Ready 0 Disable" mask="0x1" />
          <bitfield name="VREFUPD" caption="VREF Update" mask="0x40" />
          <bitfield name="VREFRDY" caption="VREF Ready" mask="0x80" />
          <bitfield name="PFFUNF" caption="APB FIFO underflow" mask="0x100" />
          <bitfield name="PFFOVF" caption="APB FIFO overflow" mask="0x200" />
          <bitfield name="PFFRDY" caption="APB FIFO Ready" mask="0x400" />
          <bitfield name="PFFHFUL" caption="APB FIFO Half Full" mask="0x800" />
        </register>
        <register name="CTLINTFLAG" offset="0x104" rw="RW" size="4" atomic-op="clear:CTLINTFLAG" initval="0x00000000" caption="CORE Controller Interrupt Flags">
          <bitfield name="CRRDY" caption="Core Ready" mask="0xF" />
          <bitfield name="VREFUPD" caption="VREF update" mask="0x40" />
          <bitfield name="VREFRDY" caption="VREF Ready" mask="0x80" />
          <bitfield name="PFFUNF" caption="APB FIFO underflow" mask="0x100" />
          <bitfield name="PFFOVF" caption="APB FIFO overflow" mask="0x200" />
          <bitfield name="PFFRDY" caption="APB FIFO Ready" mask="0x400" />
          <bitfield name="PFFHFUL" caption="APB FIFO Half Full" mask="0x800" />
        </register>
        <register-group name="INT" name-in-module="INT" offset="0x120" size="0x10" count="1" />
        <register name="DBGCTRL" offset="0x168" rw="RW" size="4" initval="0x00000000" caption="Debug Control Register">
          <bitfield name="DBGRUN" caption="Debug Running State" mask="0x1" />
        </register>
      </register-group>
      <value-group name="CORCTRL__SELRES">
        <value name="6_BITS" caption="6 bits" value="0" />
        <value name="8_BITS" caption="8 bits" value="1" />
        <value name="10_BITS" caption="10 bits" value="2" />
        <value name="12_BITS" caption="12 bits (power-on default)" value="3" />
      </value-group>
      <value-group name="CORCTRL__STRGSRC">
        <value name="NO_TRIGGER" caption="No Trigger (NOP)" value="0" />
        <value name="GLOBAL_SOFTWARE_TRIGGER" caption="Global Software Trigger" value="1" />
        <value name="GLOBAL_LEVEL_TRIGGER" caption="Global Level Software Trigger" value="2" />
        <value name="SYNC_TRIGGER" caption="Synchronous Trigger (STRIG)" value="4" />
        <value name="EVENT_USER0" caption="ADC Trigger Event User 0" value="5" />
        <value name="EVENT_USER1" caption="ADC Trigger Event User 1" value="6" />
        <value name="EVENT_USER2" caption="ADC Trigger Event User 2" value="7" />
        <value name="EVENT_USER3" caption="ADC Trigger Event User 3" value="8" />
        <value name="EVENT_USER4" caption="ADC Trigger Event User 4" value="9" />
        <value name="EVENT_USER5" caption="ADC Trigger Event User 5" value="10" />
        <value name="EVENT_USER6" caption="ADC Trigger Event User 6" value="11" />
        <value name="EVENT_USER7" caption="ADC Trigger Event User 7" value="12" />
        <value name="EVENT_USER8" caption="ADC Trigger Event User 8" value="13" />
        <value name="EVENT_USER9" caption="ADC Trigger Event User 9" value="14" />
        <value name="EVENT_USER10" caption="ADC Trigger Event User 10" value="15" />
      </value-group>
      <value-group name="CHNCFG4__TRGSRC0">
        <value name="NO_TRIGGER" caption="No Trigger (NOP)" value="0" />
        <value name="GLOBAL_SOFTWARE_TRIGGER" caption="Global Software Trigger" value="1" />
        <value name="GLOBAL_LEVEL_TRIGGER" caption="Global Level Software Trigger" value="2" />
        <value name="SCAN_TRIGGER" caption="SCANTRG - Scan Trigger" value="3" />
        <value name="SYNC_TRIGGER" caption="Synchronous Trigger (STRIG)" value="4" />
        <value name="EVENT_USER0" caption="ADC Trigger Event User 0" value="5" />
        <value name="EVENT_USER1" caption="ADC Trigger Event User 1" value="6" />
        <value name="EVENT_USER2" caption="ADC Trigger Event User 2" value="7" />
        <value name="EVENT_USER3" caption="ADC Trigger Event User 3" value="8" />
        <value name="EVENT_USER4" caption="ADC Trigger Event User 4" value="9" />
        <value name="EVENT_USER5" caption="ADC Trigger Event User 5" value="10" />
        <value name="EVENT_USER6" caption="ADC Trigger Event User 6" value="11" />
        <value name="EVENT_USER7" caption="ADC Trigger Event User 7" value="12" />
        <value name="EVENT_USER8" caption="ADC Trigger Event User 8" value="13" />
        <value name="EVENT_USER9" caption="ADC Trigger Event User 9" value="14" />
        <value name="EVENT_USER10" caption="ADC Trigger Event User 10" value="15" />
      </value-group>
      <value-group name="CHNCFG4__TRGSRC1">
        <value name="NO_TRIGGER" caption="No Trigger (NOP)" value="0" />
        <value name="GLOBAL_SOFTWARE_TRIGGER" caption="Global Software Trigger" value="1" />
        <value name="GLOBAL_LEVEL_TRIGGER" caption="Global Level Software Trigger" value="2" />
        <value name="SCAN_TRIGGER" caption="SCANTRG - Scan Trigger" value="3" />
        <value name="SYNC_TRIGGER" caption="Synchronous Trigger (STRIG)" value="4" />
        <value name="EVENT_USER0" caption="ADC Trigger Event User 0" value="5" />
        <value name="EVENT_USER1" caption="ADC Trigger Event User 1" value="6" />
        <value name="EVENT_USER2" caption="ADC Trigger Event User 2" value="7" />
        <value name="EVENT_USER3" caption="ADC Trigger Event User 3" value="8" />
        <value name="EVENT_USER4" caption="ADC Trigger Event User 4" value="9" />
        <value name="EVENT_USER5" caption="ADC Trigger Event User 5" value="10" />
        <value name="EVENT_USER6" caption="ADC Trigger Event User 6" value="11" />
        <value name="EVENT_USER7" caption="ADC Trigger Event User 7" value="12" />
        <value name="EVENT_USER8" caption="ADC Trigger Event User 8" value="13" />
        <value name="EVENT_USER9" caption="ADC Trigger Event User 9" value="14" />
        <value name="EVENT_USER10" caption="ADC Trigger Event User 10" value="15" />
      </value-group>
      <value-group name="CHNCFG4__TRGSRC2">
        <value name="NO_TRIGGER" caption="No Trigger (NOP)" value="0" />
        <value name="GLOBAL_SOFTWARE_TRIGGER" caption="Global Software Trigger" value="1" />
        <value name="GLOBAL_LEVEL_TRIGGER" caption="Global Level Software Trigger" value="2" />
        <value name="SCAN_TRIGGER" caption="SCANTRG - Scan Trigger" value="3" />
        <value name="SYNC_TRIGGER" caption="Synchronous Trigger (STRIG)" value="4" />
        <value name="EVENT_USER0" caption="ADC Trigger Event User 0" value="5" />
        <value name="EVENT_USER1" caption="ADC Trigger Event User 1" value="6" />
        <value name="EVENT_USER2" caption="ADC Trigger Event User 2" value="7" />
        <value name="EVENT_USER3" caption="ADC Trigger Event User 3" value="8" />
        <value name="EVENT_USER4" caption="ADC Trigger Event User 4" value="9" />
        <value name="EVENT_USER5" caption="ADC Trigger Event User 5" value="10" />
        <value name="EVENT_USER6" caption="ADC Trigger Event User 6" value="11" />
        <value name="EVENT_USER7" caption="ADC Trigger Event User 7" value="12" />
        <value name="EVENT_USER8" caption="ADC Trigger Event User 8" value="13" />
        <value name="EVENT_USER9" caption="ADC Trigger Event User 9" value="14" />
        <value name="EVENT_USER10" caption="ADC Trigger Event User 10" value="15" />
      </value-group>
      <value-group name="CHNCFG4__TRGSRC3">
        <value name="NO_TRIGGER" caption="No Trigger (NOP)" value="0" />
        <value name="GLOBAL_SOFTWARE_TRIGGER" caption="Global Software Trigger" value="1" />
        <value name="GLOBAL_LEVEL_TRIGGER" caption="Global Level Software Trigger" value="2" />
        <value name="SCAN_TRIGGER" caption="SCANTRG - Scan Trigger" value="3" />
        <value name="SYNC_TRIGGER" caption="Synchronous Trigger (STRIG)" value="4" />
        <value name="EVENT_USER0" caption="ADC Trigger Event User 0" value="5" />
        <value name="EVENT_USER1" caption="ADC Trigger Event User 1" value="6" />
        <value name="EVENT_USER2" caption="ADC Trigger Event User 2" value="7" />
        <value name="EVENT_USER3" caption="ADC Trigger Event User 3" value="8" />
        <value name="EVENT_USER4" caption="ADC Trigger Event User 4" value="9" />
        <value name="EVENT_USER5" caption="ADC Trigger Event User 5" value="10" />
        <value name="EVENT_USER6" caption="ADC Trigger Event User 6" value="11" />
        <value name="EVENT_USER7" caption="ADC Trigger Event User 7" value="12" />
        <value name="EVENT_USER8" caption="ADC Trigger Event User 8" value="13" />
        <value name="EVENT_USER9" caption="ADC Trigger Event User 9" value="14" />
        <value name="EVENT_USER10" caption="ADC Trigger Event User 10" value="15" />
      </value-group>
