zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00100.atdf
        <register name="DCC" offset="0x118" rw="RW" size="4" count="2" initval="0x00000000" caption="Debug Communication Channel n REGISTER">
          <bitfield name="DATA" caption="Data" mask="0xFFFFFFFF" />
        </register>
        <register name="DID" offset="0x120" rw="RW" size="4" initval="0x00000053" caption="Device Identification Register">
          <bitfield name="FV" caption="Fixed Value of 1" mask="0x1" />
          <bitfield name="MANID" caption="JEDEC Manufacture ID" mask="0xFFE" />
          <bitfield name="PNDID" caption="Part Number Device ID" mask="0xFF000" />
          <bitfield name="PNMID" caption="Part Number Mask ID" mask="0xFF00000" />
          <bitfield name="VER" caption="Version Code" mask="0xF0000000" />
        </register>
        <register name="DAL" offset="0x124" rw="R" size="4" initval="0x00000000" caption="Debugger Access Level REGISTER">
          <bitfield name="CPU0" caption="CPU 0 Debugger Access Level" mask="0x3" values="DAL__CPU0" />
          <bitfield name="CPU1" caption="CPU n Debugger Access Level" mask="0xC" values="DAL__CPU" />
          <bitfield name="CPU2" caption="CPU n Debugger Access Level" mask="0x30" values="DAL__CPU" />
          <bitfield name="CPU3" caption="CPU n Debugger Access Level" mask="0xC0" values="DAL__CPU" />
        </register>
        <register name="ENTRY0" offset="0x1000" rw="R" size="4" initval="0x9C0FE002" caption="CoreSight ROM Table Entry N Register">
          <bitfield name="EPRES" caption="CoreSight Entry Present" mask="0x1" values="ENTRY0__EPRES" />
          <bitfield name="FMT" caption="CoreSight Rom Table Format" mask="0x2" values="ENTRY0__FMT" />
          <bitfield name="ADDOFF" caption="CoreSight ROM Table Address Offset" mask="0xFFFFF000" />
        </register>
        <register name="ENTRY1" offset="0x1004" rw="R" size="4" initval="0xBBFFF002" caption="CoreSight ROM Table Entry N Register">
          <bitfield name="EPRES" caption="CoreSight Entry Present" mask="0x1" values="ENTRY1__EPRES" />
          <bitfield name="FMT" caption="CoreSight Rom Table Format" mask="0x2" values="ENTRY1__FMT" />
          <bitfield name="ADDOFF" caption="CoreSight ROM Table Address Offset" mask="0xFFFFF000" />
        </register>
        <register name="ENTRY2" offset="0x1008" rw="R" size="4" initval="0xBBFFF002" caption="CoreSight ROM Table Entry N Register">
          <bitfield name="EPRES" caption="CoreSight Entry Present" mask="0x1" values="ENTRY2__EPRES" />
          <bitfield name="FMT" caption="CoreSight Rom Table Format" mask="0x2" values="ENTRY2__FMT" />
          <bitfield name="ADDOFF" caption="CoreSight ROM Table Address Offset" mask="0xFFFFF000" />
        </register>
        <register name="ENTRY3" offset="0x100C" rw="R" size="4" initval="0xBBFFF002" caption="CoreSight ROM Table Entry N Register">
          <bitfield name="EPRES" caption="CoreSight Entry Present" mask="0x1" values="ENTRY3__EPRES" />
          <bitfield name="FMT" caption="CoreSight Rom Table Format" mask="0x2" values="ENTRY3__FMT" />
          <bitfield name="ADDOFF" caption="CoreSight ROM Table Address Offset" mask="0xFFFFF000" />
        </register>
        <register name="ENTRY4" offset="0x1010" rw="R" size="4" initval="0x00000000" caption="CoreSight ROM Table Entry 4 Register">
          <bitfield name="EPRES" caption="CoreSight Entry Present" mask="0x1" values="ENTRY4__EPRES" />
          <bitfield name="FMT" caption="CoreSight Rom Table Format" mask="0x2" values="ENTRY4__FMT" />
          <bitfield name="ADDOFF" caption="CoreSight ROM Table Address Offset" mask="0xFFFFF000" />
        </register>
        <register name="ENTRY5" offset="0x1014" rw="R" size="4" initval="0x00000000" caption="CoreSight ROM Table Entry 5 Register">
          <bitfield name="EPRES" caption="CoreSight Entry Present" mask="0x1" values="ENTRY5__EPRES" />
          <bitfield name="FMT" caption="CoreSight Rom Table Format" mask="0x2" values="ENTRY5__FMT" />
          <bitfield name="ADDOFF" caption="CoreSight ROM Table Address Offset" mask="0xFFFFF000" />
        </register>
        <register name="ENTRY6" offset="0x1018" rw="R" size="4" initval="0x00000000" caption="CoreSight ROM Table Entry 6 Register">
          <bitfield name="EPRES" caption="CoreSight Entry Present" mask="0x1" values="ENTRY6__EPRES" />
          <bitfield name="FMT" caption="CoreSight Rom Table Format" mask="0x2" values="ENTRY6__FMT" />
          <bitfield name="ADDOFF" caption="CoreSight ROM Table Address Offset" mask="0xFFFFF000" />
        </register>
        <register name="ENTRY7" offset="0x101C" rw="R" size="4" initval="0x00000000" caption="CoreSight ROM Table Entry 7 Register">
          <bitfield name="EPRES" caption="CoreSight Entry Present" mask="0x1" values="ENTRY7__EPRES" />
          <bitfield name="FMT" caption="CoreSight Rom Table Format" mask="0x2" values="ENTRY7__FMT" />
          <bitfield name="ADDOFF" caption="CoreSight ROM Table Address Offset" mask="0xFFFFF000" />
        </register>
        <register name="MEMTYPE" offset="0x1FCC" rw="R" size="4" initval="0x00000000" caption="CoreSight ROM Table Memory Type Register">
          <bitfield name="SYSMEM" caption="CoreSight System Memory Present" mask="0x1" values="MEMTYPE__SYSMEM" />
        </register>
        <register name="PID4" offset="0x1FD0" rw="R" size="4" initval="0x00000000" caption="CoreSight Peripheral Identification 4 Register">
          <bitfield name="DES2" caption="CoreSight JEP106 Continuation Code" mask="0xF" />
          <bitfield name="SIZE" caption="CoreSight Size" mask="0xF0" />
        </register>
        <register name="PID5" offset="0x1FD4" rw="R" size="4" initval="0x00000000" caption="CoreSight Peripheral Identification 5 Register">
          <bitfield name="RES0" caption="CoreSight Reserved Field" mask="0xFF" />
        </register>
        <register name="PID6" offset="0x1FD8" rw="R" size="4" initval="0x00000000" caption="CoreSight Peripheral Identification 6 Register">
          <bitfield name="RES0" caption="CoreSight Reserved Field" mask="0xFF" />
        </register>
        <register name="PID7" offset="0x1FDC" rw="R" size="4" initval="0x00000000" caption="CoreSight Peripheral Identification 7 Register">
          <bitfield name="RES0" caption="CoreSight Reserved Field" mask="0xFF" />
        </register>
