zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00100.atdf
        <register name="PID0" offset="0x1FE0" rw="R" size="4" initval="0x000000D0" caption="CoreSight Peripheral Identification 0 Register">
          <bitfield name="PART0" caption="CoreSight Part Number Bits[7:0]" mask="0xFF" />
        </register>
        <register name="PID1" offset="0x1FE4" rw="R" size="4" initval="0x0000009C" caption="CoreSight Peripheral Identification 1 Register">
          <bitfield name="PART1" caption="CoreSight Part Number Bits[11:8]" mask="0xF" />
          <bitfield name="DES0" caption="CoreSight JEP106 Identification Code Bits [3:0]" mask="0xF0" />
        </register>
        <register name="PID2" offset="0x1FE8" rw="R" size="4" initval="0x0000000A" caption="CoreSight Peripheral Identification 2 Register">
          <bitfield name="DES1" caption="CoreSight JEP106 Identification Code Bits [6:4]" mask="0x7" />
          <bitfield name="JEDEC" caption="CoreSight JEDEC Assignment" mask="0x8" />
          <bitfield name="REVISION" caption="CoreSight Revision" mask="0xF0" />
        </register>
        <register name="PID3" offset="0x1FEC" rw="R" size="4" initval="0x00000000" caption="CoreSight Peripheral Identification 3 Register">
          <bitfield name="CMOD" caption="CoreSight Custom Modifier 0" mask="0xF" />
          <bitfield name="REVAND" caption="CoreSight REVAND" mask="0xF0" />
        </register>
        <register name="CID0" offset="0x1FF0" rw="R" size="4" initval="0x0000000D" caption="CoreSight Component Identification 0 Register">
          <bitfield name="PRMBL0" caption="CoreSight Preamble 0" mask="0xFF" />
        </register>
        <register name="CID1" offset="0x1FF4" rw="R" size="4" initval="0x00000010" caption="CoreSight Component Identification 1 Register">
          <bitfield name="PRMBL1" caption="CoreSight Preamble 1" mask="0xF" />
          <bitfield name="CCLASS" caption="CoreSight Component Class" mask="0xF0" />
        </register>
        <register name="CID2" offset="0x1FF8" rw="R" size="4" initval="0x00000005" caption="CoreSight Component Identification 2 Register">
          <bitfield name="PRMBL2" caption="CoreSight Preamble 2" mask="0xFF" />
        </register>
        <register name="CID3" offset="0x1FFC" rw="R" size="4" initval="0x000000B1" caption="CoreSight Component Identification 3 Register">
          <bitfield name="PRMBL3" caption="CoreSight Preamble 3" mask="0xFF" />
        </register>
      </register-group>
      <value-group name="CTRLA__PRIV">
        <value name="0" caption="Internal Address Space registers accessible in privileged and unprivileged modes. Test functions generate unprivileged requests." value="0" />
        <value name="1" caption="Internal Address Space registers only accessible in privileged mode. Test functions generate privileged requests." value="1" />
      </value-group>
      <value-group name="CTRLB__DCCDMALVL">
        <value name="EMPTY" caption="Trigger n rises when DCCn is read and falls when it is written" value="0" />
        <value name="FULL" caption="Trigger n rises when DCCn is written and falls when it is read" value="1" />
      </value-group>
      <value-group name="CTRLC__DBGRW">
        <value name="0" caption="Allow debugger accesses through CPUn to carry the debug attribute (i.e debugger reads are non-destructive)." value="0" />
        <value name="1" caption="Debugger accesses through CPUn do not carry the debug attribute (i.e debugger reads are destructive)." value="1" />
      </value-group>
      <value-group name="STATUSA__DONE">
        <value name="0" caption="DSU is executing a command or idle." value="0" />
        <value name="1" caption="TCTRL.CMD command completed" value="1" />
      </value-group>
      <value-group name="STATUSA__BERR">
        <value name="0" caption="No bus error detected" value="0" />
        <value name="1" caption="Bus error incurred while performing the DSU command." value="1" />
      </value-group>
      <value-group name="STATUSA__PERR">
        <value name="0" caption="No protection error detected" value="0" />
        <value name="1" caption="Invalid command written to TCTRL.CMD, partial write to the upper or lower bytes of TCTRL.CMD, or invalid key written to SAFEDOOR." value="1" />
      </value-group>
      <value-group name="STATUSA__ROMCRC">
        <value name="0" caption="CRC is in progress" value="0" />
        <value name="1" caption="CRC completed but failed indicating possible issue with the ROM content. System held in lockup state." value="1" />
        <value name="2" caption="CRC completed and passed" value="2" />
        <value name="3" caption="CRC never executed because user disabled CRC check through fuse settings." value="3" />
      </value-group>
      <value-group name="STATUSA__CRSTEXT">
        <value name="0" caption="CPUx released from reset extension." value="0" />
        <value name="1" caption="CPUx held in reset extension. Set on Cold-Plugging detection." value="1" />
      </value-group>
      <value-group name="STATUSA__BREXT">
        <value name="0" caption="Boot ROM Phase Extension released for CPUx." value="0" />
        <value name="1" caption="Boot ROM Phase Extension for CPUx. Set on Cold-Plugging detection." value="1" />
      </value-group>
      <value-group name="STATUSB__BCCD">
        <value name="0" caption="BCCDx.DATA register was read from." value="0" />
        <value name="1" caption="BCCDx.DATA register was written to." value="1" />
      </value-group>
      <value-group name="STATUSB__DCCD">
        <value name="0" caption="DCCDx.DATA register was read from." value="0" />
        <value name="1" caption="DCCDx.DATA register was written to." value="1" />
      </value-group>
      <value-group name="STATUSB__DBGPRES">
        <value name="0" caption="No debugger detected" value="0" />
        <value name="1" caption="Debugger probe detected" value="1" />
      </value-group>
      <value-group name="STATUSB__HPS">
        <value name="0" caption="Hot-Plugging inactive" value="0" />
        <value name="1" caption="Hot-Plugging active" value="1" />
      </value-group>
