zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00100.atdf
        <register name="DWT_LAR" offset="0xFB0" rw="W" size="4" access-size="4" caption="DWT Software Lock Access Register">
          <bitfield name="KEY" caption="Lock access control" mask="0xFFFFFFFF" values="DWT_LAR__KEY" />
        </register>
        <register name="DWT_LSR" offset="0xFB4" rw="R" size="4" access-size="4" caption="DWT Software Lock Status Register">
          <bitfield name="SLI" caption="Software Lock implemented" mask="0x1" />
          <bitfield name="SLK" caption="Software Lock status" mask="0x2" />
          <bitfield name="nTT" caption="Not thirty-two bit" mask="0x4" />
        </register>
        <register name="DWT_DEVARCH" offset="0xFBC" rw="R" size="4" access-size="4" initval="0x47701A02" caption="DWT Device Architecture Register">
          <bitfield name="ARCHPART" caption="Architecture Part" mask="0xFFF" />
          <bitfield name="ARCHVER" caption="Architecture Version" mask="0xF000" />
          <bitfield name="REVISION" caption="Revision" mask="0xF0000" />
          <bitfield name="PRESENT" caption="DEVARCH Present" mask="0x100000" />
          <bitfield name="ARCHITECT" caption="Architect" mask="0xFFE00000" />
        </register>
        <register name="DWT_DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" initval="0x00000000" caption="DWT Device Type Register">
          <bitfield name="MAJOR" caption="Major type" mask="0xF" />
          <bitfield name="SUB" caption="Sub-type" mask="0xF0" />
        </register>
        <register name="DWT_PIDR4" offset="0xFD0" rw="R" size="4" access-size="4" caption="DWT Peripheral Identification Register 4">
          <bitfield name="DES_2" caption="JEP106 continuation code" mask="0xF" />
          <bitfield name="SIZE" caption="4KB count" mask="0xF0" />
        </register>
        <register name="DWT_PIDR5" offset="0xFD4" rw="R" size="4" access-size="4" initval="0x00000000" caption="DWT Peripheral Identification Register 5" />
        <register name="DWT_PIDR6" offset="0xFD8" rw="R" size="4" access-size="4" initval="0x00000000" caption="DWT Peripheral Identification Register 6" />
        <register name="DWT_PIDR7" offset="0xFDC" rw="R" size="4" access-size="4" initval="0x00000000" caption="DWT Peripheral Identification Register 7" />
        <register name="DWT_PIDR0" offset="0xFE0" rw="R" size="4" access-size="4" caption="DWT Peripheral Identification Register 0">
          <bitfield name="PART_0" caption="Part number bits[7:0]" mask="0xFF" />
        </register>
        <register name="DWT_PIDR1" offset="0xFE4" rw="R" size="4" access-size="4" caption="DWT Peripheral Identification Register 1">
          <bitfield name="PART_1" caption="Part number bits[11:8]" mask="0xF" />
          <bitfield name="DES_0" caption="JEP106 identification code bits [3:0]" mask="0xF0" />
        </register>
        <register name="DWT_PIDR2" offset="0xFE8" rw="R" size="4" access-size="4" caption="DWT Peripheral Identification Register 2">
          <bitfield name="DES_1" caption="JEP106 identification code bits[6:4]" mask="0x7" />
          <bitfield name="JEDEC" caption="JEDEC assignee value is used" mask="0x8" />
          <bitfield name="REVISION" caption="Component revision" mask="0xF0" />
        </register>
        <register name="DWT_PIDR3" offset="0xFEC" rw="R" size="4" access-size="4" caption="DWT Peripheral Identification Register 3">
          <bitfield name="CMOD" caption="Customer Modified" mask="0xF" />
          <bitfield name="REVAND" caption="RevAnd" mask="0xF0" />
        </register>
        <register name="DWT_CIDR0" offset="0xFF0" rw="R" size="4" access-size="4" initval="0x0000000D" caption="DWT Component Identification Register 0">
          <bitfield name="PRMBL_0" caption="CoreSight component identification preamble" mask="0xFF" />
        </register>
        <register name="DWT_CIDR1" offset="0xFF4" rw="R" size="4" access-size="4" initval="0x00000090" caption="DWT Component Identification Register 1">
          <bitfield name="PRMBL_1" caption="CoreSight component identification preamble" mask="0xF" />
          <bitfield name="CLASS" caption="CoreSight component class" mask="0xF0" />
        </register>
        <register name="DWT_CIDR2" offset="0xFF8" rw="R" size="4" access-size="4" initval="0x00000005" caption="DWT Component Identification Register 2">
          <bitfield name="PRMBL_2" caption="CoreSight component identification preamble" mask="0xFF" />
        </register>
        <register name="DWT_CIDR3" offset="0xFFC" rw="R" size="4" access-size="4" initval="0x000000B1" caption="DWT Component Identification Register 3">
          <bitfield name="PRMBL_3" caption="CoreSight component identification preamble" mask="0xFF" />
        </register>
      </register-group>
      <value-group name="DWT_LAR__KEY">
        <value name="UNLOCK" caption="Unlock key value" value="0xC5ACCE55" />
      </value-group>
    </module>
    <module name="EIC" id="03706" name2="int_eic_u2804_v1" version="1b0" caption="External Interrupt Controller">
      <register-group name="EIC" caption="External Interrupt Controller">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1" />
          <bitfield name="ENABLE" caption="Enable" mask="0x2" />
          <bitfield name="CKSEL" caption="Clock Selection" mask="0x10" values="CTRLA__CKSEL" />
        </register>
        <register name="NMICTRL" offset="0x1" rw="RW" size="1" initval="0x00" caption="Non-Maskable Interrupt Control">
          <bitfield name="NMISENSE" caption="Non-Maskable Interrupt Sense Configuration" mask="0x7" values="NMICTRL__NMISENSE" />
          <bitfield name="NMIFILTEN" caption="Non-Maskable Interrupt Filter Enable" mask="0x8" />
          <bitfield name="NMIASYNCH" caption="Asynchronous Edge Detection Mode" mask="0x10" values="NMICTRL__NMIASYNCH" />
        </register>
        <register name="NMIFLAG" offset="0x2" rw="RW" size="2" atomic-op="clear:NMIFLAG" initval="0x0000" caption="Non-Maskable Interrupt Flag Status and Clear">
          <bitfield name="NMI" caption="Non-Maskable Interrupt" mask="0x1" />
        </register>
        <register name="SYNCBUSY" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy Status" mask="0x1" />
          <bitfield name="ENABLE" caption="Enable Synchronization Busy Status" mask="0x2" />
        </register>
        <register name="EVCTRL" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="EXTINTEO" caption="External Interrupt Event Output Enable" mask="0xFFFF" />
        </register>
        <register name="INTENCLR" offset="0xC" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="EXTINT" caption="External Interrupt Enable" mask="0xFFFF" />
          <bitfield name="NSCHK" caption="Non-secure Check Interrupt Enable" mask="0x80000000" />
        </register>
