zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00100.atdf
      <value-group name="CONFIG__SENSE1">
        <value name="NONE" caption="No detection" value="0" />
        <value name="RISE" caption="Rising edge detection" value="1" />
        <value name="FALL" caption="Falling edge detection" value="2" />
        <value name="BOTH" caption="Both edges detection" value="3" />
        <value name="HIGH" caption="High level detection" value="4" />
        <value name="LOW" caption="Low level detection" value="5" />
      </value-group>
      <value-group name="CONFIG__SENSE2">
        <value name="NONE" caption="No detection" value="0" />
        <value name="RISE" caption="Rising edge detection" value="1" />
        <value name="FALL" caption="Falling edge detection" value="2" />
        <value name="BOTH" caption="Both edges detection" value="3" />
        <value name="HIGH" caption="High level detection" value="4" />
        <value name="LOW" caption="Low level detection" value="5" />
      </value-group>
      <value-group name="CONFIG__SENSE3">
        <value name="NONE" caption="No detection" value="0" />
        <value name="RISE" caption="Rising edge detection" value="1" />
        <value name="FALL" caption="Falling edge detection" value="2" />
        <value name="BOTH" caption="Both edges detection" value="3" />
        <value name="HIGH" caption="High level detection" value="4" />
        <value name="LOW" caption="Low level detection" value="5" />
      </value-group>
      <value-group name="CONFIG__SENSE4">
        <value name="NONE" caption="No detection" value="0" />
        <value name="RISE" caption="Rising edge detection" value="1" />
        <value name="FALL" caption="Falling edge detection" value="2" />
        <value name="BOTH" caption="Both edges detection" value="3" />
        <value name="HIGH" caption="High level detection" value="4" />
        <value name="LOW" caption="Low level detection" value="5" />
      </value-group>
      <value-group name="CONFIG__SENSE5">
        <value name="NONE" caption="No detection" value="0" />
        <value name="RISE" caption="Rising edge detection" value="1" />
        <value name="FALL" caption="Falling edge detection" value="2" />
        <value name="BOTH" caption="Both edges detection" value="3" />
        <value name="HIGH" caption="High level detection" value="4" />
        <value name="LOW" caption="Low level detection" value="5" />
      </value-group>
      <value-group name="CONFIG__SENSE6">
        <value name="NONE" caption="No detection" value="0" />
        <value name="RISE" caption="Rising edge detection" value="1" />
        <value name="FALL" caption="Falling edge detection" value="2" />
        <value name="BOTH" caption="Both edges detection" value="3" />
        <value name="HIGH" caption="High level detection" value="4" />
        <value name="LOW" caption="Low level detection" value="5" />
      </value-group>
      <value-group name="CONFIG__SENSE7">
        <value name="NONE" caption="No detection" value="0" />
        <value name="RISE" caption="Rising edge detection" value="1" />
        <value name="FALL" caption="Falling edge detection" value="2" />
        <value name="BOTH" caption="Both edges detection" value="3" />
        <value name="HIGH" caption="High level detection" value="4" />
        <value name="LOW" caption="Low level detection" value="5" />
      </value-group>
      <value-group name="DPRESCALER__PRESCALER">
        <value name="DIV2" caption="EIC clock divided by 2" value="0" />
        <value name="DIV4" caption="EIC clock divided by 4" value="1" />
        <value name="DIV8" caption="EIC clock divided by 8" value="2" />
        <value name="DIV16" caption="EIC clock divided by 16" value="3" />
        <value name="DIV32" caption="EIC clock divided by 32" value="4" />
        <value name="DIV64" caption="EIC clock divided by 64" value="5" />
        <value name="DIV128" caption="EIC clock divided by 128" value="6" />
        <value name="DIV256" caption="EIC clock divided by 256" value="7" />
      </value-group>
      <value-group name="DPRESCALER__STATES">
        <value name="LFREQ3" caption="3 low frequency samples" value="0" />
        <value name="LFREQ7" caption="7 low frequency samples" value="1" />
      </value-group>
      <value-group name="DPRESCALER__TICKON">
        <value name="CLK_GCLK_EIC" caption="Bounce sampler is using GCLK_EIC" value="0" />
        <value name="CLK_LFREQ" caption="Bounce sampler is using Low Frequency Clock" value="1" />
      </value-group>
    </module>
    <module name="EVSYS" id="03601" name2="ptg_evsys_u2504_v2" version="2b0" caption="Event System Interface">
      <register-group name="CHANNEL" size="0x8">
        <register name="CHANNEL" offset="0x0" rw="RW" size="4" initval="0x00008000" caption="Channel n Control">
          <bitfield name="EVGEN" caption="Event Generator Selection" mask="0x7F" />
          <bitfield name="PATH" caption="Path Selection" mask="0x300" values="CHANNEL__PATH" />
          <bitfield name="EDGSEL" caption="Edge Detection Selection" mask="0xC00" values="CHANNEL__EDGSEL" />
          <bitfield name="RUNSTDBY" caption="Run in standby" mask="0x4000" />
          <bitfield name="ONDEMAND" caption="Generic Clock On Demand" mask="0x8000" />
        </register>
        <register name="CHINTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:CHINTENCLR" initval="0x00" caption="Channel n Interrupt Enable Clear">
          <bitfield name="OVR" caption="Channel Overrun Interrupt Disable" mask="0x1" />
          <bitfield name="EVD" caption="Channel Event Detected Interrupt Disable" mask="0x2" />
        </register>
        <register name="CHINTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:CHINTENSET" initval="0x00" caption="Channel n Interrupt Enable Set">
          <bitfield name="OVR" caption="Channel Overrun Interrupt Enable" mask="0x1" />
          <bitfield name="EVD" caption="Channel Event Detected Interrupt Enable" mask="0x2" />
        </register>
        <register name="CHINTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:CHINTFLAG" initval="0x00" caption="Channel n Interrupt Flag Status and Clear">
          <bitfield name="OVR" caption="Channel Overrun" mask="0x1" />
          <bitfield name="EVD" caption="Channel Event Detected" mask="0x2" />
        </register>
        <register name="CHSTATUS" offset="0x7" rw="R" size="1" initval="0x01" caption="Channel n Status">
          <bitfield name="RDYUSR" caption="Ready User" mask="0x1" />
          <bitfield name="BUSYCH" caption="Busy Channel" mask="0x2" />
        </register>
      </register-group>
