zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00100.atdf
      <register-group name="EVSYS" caption="Event System Interface">
        <register name="CTRLA" offset="0x0" rw="W" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1" />
        </register>
        <register name="SWEVT" offset="0x4" rw="W" size="4" initval="0x00000000" caption="Software Event">
          <bitfield name="CHANNEL0" caption="Channel 0 Software Selection" mask="0x1" />
          <bitfield name="CHANNEL1" caption="Channel 1 Software Selection" mask="0x2" />
          <bitfield name="CHANNEL2" caption="Channel 2 Software Selection" mask="0x4" />
          <bitfield name="CHANNEL3" caption="Channel 3 Software Selection" mask="0x8" />
          <bitfield name="CHANNEL4" caption="Channel 4 Software Selection" mask="0x10" />
          <bitfield name="CHANNEL5" caption="Channel 5 Software Selection" mask="0x20" />
          <bitfield name="CHANNEL6" caption="Channel 6 Software Selection" mask="0x40" />
          <bitfield name="CHANNEL7" caption="Channel 7 Software Selection" mask="0x80" />
          <bitfield name="CHANNEL8" caption="Channel 8 Software Selection" mask="0x100" />
          <bitfield name="CHANNEL9" caption="Channel 9 Software Selection" mask="0x200" />
          <bitfield name="CHANNEL10" caption="Channel 10 Software Selection" mask="0x400" />
          <bitfield name="CHANNEL11" caption="Channel 11 Software Selection" mask="0x800" />
        </register>
        <register name="PRICTRL" offset="0x8" rw="RW" size="1" initval="0x00" caption="Priority Control">
          <bitfield name="PRI" caption="Channel Priority Number" mask="0xF" />
          <bitfield name="RREN" caption="Round-Robin Scheduling Enable" mask="0x80" />
        </register>
        <register name="INTPEND" offset="0x10" rw="RW" size="2" initval="0x4000" caption="Channel Pending Interrupt">
          <bitfield name="ID" caption="Channel ID" mask="0xF" />
          <bitfield name="OVR" caption="Channel Overrun" mask="0x100" />
          <bitfield name="EVD" caption="Channel Event Detected" mask="0x200" />
          <bitfield name="READY" caption="Ready" mask="0x4000" />
          <bitfield name="BUSY" caption="Busy" mask="0x8000" />
        </register>
        <register name="INTSTATUS" offset="0x14" rw="R" size="4" initval="0x00000000" caption="Interrupt Status">
          <bitfield name="CHINT0" caption="Channel 0 Pending Interrupt" mask="0x1" />
          <bitfield name="CHINT1" caption="Channel 1 Pending Interrupt" mask="0x2" />
          <bitfield name="CHINT2" caption="Channel 2 Pending Interrupt" mask="0x4" />
          <bitfield name="CHINT3" caption="Channel 3 Pending Interrupt" mask="0x8" />
          <bitfield name="CHINT4" caption="Channel 4 Pending Interrupt" mask="0x10" />
          <bitfield name="CHINT5" caption="Channel 5 Pending Interrupt" mask="0x20" />
          <bitfield name="CHINT6" caption="Channel 6 Pending Interrupt" mask="0x40" />
          <bitfield name="CHINT7" caption="Channel 7 Pending Interrupt" mask="0x80" />
          <bitfield name="CHINT8" caption="Channel 8 Pending Interrupt" mask="0x100" />
          <bitfield name="CHINT9" caption="Channel 9 Pending Interrupt" mask="0x200" />
          <bitfield name="CHINT10" caption="Channel 10 Pending Interrupt" mask="0x400" />
          <bitfield name="CHINT11" caption="Channel 11 Pending Interrupt" mask="0x800" />
        </register>
        <register name="BUSYCH" offset="0x18" rw="R" size="4" initval="0x00000000" caption="Busy Channels">
          <bitfield name="BUSYCH0" caption="Busy Channel 0" mask="0x1" />
          <bitfield name="BUSYCH1" caption="Busy Channel 1" mask="0x2" />
          <bitfield name="BUSYCH2" caption="Busy Channel 2" mask="0x4" />
          <bitfield name="BUSYCH3" caption="Busy Channel 3" mask="0x8" />
          <bitfield name="BUSYCH4" caption="Busy Channel 4" mask="0x10" />
          <bitfield name="BUSYCH5" caption="Busy Channel 5" mask="0x20" />
          <bitfield name="BUSYCH6" caption="Busy Channel 6" mask="0x40" />
          <bitfield name="BUSYCH7" caption="Busy Channel 7" mask="0x80" />
          <bitfield name="BUSYCH8" caption="Busy Channel 8" mask="0x100" />
          <bitfield name="BUSYCH9" caption="Busy Channel 9" mask="0x200" />
          <bitfield name="BUSYCH10" caption="Busy Channel 10" mask="0x400" />
          <bitfield name="BUSYCH11" caption="Busy Channel 11" mask="0x800" />
        </register>
        <register name="READYUSR" offset="0x1C" rw="R" size="4" initval="0x00000FFF" caption="Ready Users">
          <bitfield name="READYUSR0" caption="Ready User for Channel 0" mask="0x1" />
          <bitfield name="READYUSR1" caption="Ready User for Channel 1" mask="0x2" />
          <bitfield name="READYUSR2" caption="Ready User for Channel 2" mask="0x4" />
          <bitfield name="READYUSR3" caption="Ready User for Channel 3" mask="0x8" />
          <bitfield name="READYUSR4" caption="Ready User for Channel 4" mask="0x10" />
          <bitfield name="READYUSR5" caption="Ready User for Channel 5" mask="0x20" />
          <bitfield name="READYUSR6" caption="Ready User for Channel 6" mask="0x40" />
          <bitfield name="READYUSR7" caption="Ready User for Channel 7" mask="0x80" />
          <bitfield name="READYUSR8" caption="Ready User for Channel 8" mask="0x100" />
          <bitfield name="READYUSR9" caption="Ready User for Channel 9" mask="0x200" />
          <bitfield name="READYUSR10" caption="Ready User for Channel 10" mask="0x400" />
          <bitfield name="READYUSR11" caption="Ready User for Channel 11" mask="0x800" />
        </register>
        <register-group name="CHANNEL" name-in-module="CHANNEL" offset="0x020" size="0x8" count="12" />
        <register name="USER" offset="0x120" rw="RW" size="1" count="62" initval="0x00" caption="User Multiplexer n">
          <bitfield name="CHANNEL" caption="Channel Event Selection" mask="0xF" />
        </register>
      </register-group>
      <value-group name="CHANNEL__PATH">
        <value name="ASYNCHRONOUS" caption="Asynchronous path" value="0x0" />
        <value name="RESYNCHRONIZED" caption="Resynchronized path" value="0x1" />
      </value-group>
