zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00100.atdf
      <value-group name="CTRLA__FWS">
        <value name="0" caption="Zero Wait States" value="0" />
        <value name="1" caption="One Wait State" value="1" />
        <value name="14" caption="Fourteen Wait States" value="14" />
        <value name="15" caption="Fifteen Wait States" value="15" />
      </value-group>
      <value-group name="CTRLA__ADRWS">
        <value name="ZERO" caption="Add 0 Address Wait States - allowing for higher performance at lower clock frequencies" value="0" />
        <value name="ONE" caption="Add 1 Address Wait State - allowing for higher clock frequencies" value="1" />
      </value-group>
      <value-group name="CTRLA__AUTOWS">
        <value name="DISABLE" caption="Use FWS: Total flash wait states are ADRWS + FWS" value="0" />
        <value name="ENABLE" caption="Use Automatic wait states: Total flash wait states are ADRWS + Taws" value="1" />
      </value-group>
      <value-group name="CTRLA__RDBUFWS">
        <value name="ZEROWS" caption="0 Wait States" value="0" />
        <value name="DETERMINISTIC" caption="ADRWS + FWS wait state for hits to AHB read buffer" value="1" />
      </value-group>
      <value-group name="CTRLB__PRM">
        <value name="NONE" caption="No Action" value="0" />
        <value name="TOGGLE" caption="Toggle the Flash Power Mode" value="1" />
      </value-group>
      <value-group name="CTRLB__CHEINV">
        <value name="NONE" caption="No Action" value="0" />
        <value name="INV" caption="Invalidate Cache" value="1" />
      </value-group>
      <value-group name="CTRLB__SLP">
        <value name="MANUAL" caption="Maintain state of STATUS.PRM on entry to Standby" value="0" />
        <value name="RSVD01" caption="RSVD" value="1" />
        <value name="AUTOFAST" caption="Enter Flash Hibernate on entry to Standby w/ wakeup to Auto Standby" value="2" />
        <value name="AUTOSLOW" caption="Enter Flash Hibernate on entry to Standby w/ wakeup on first access" value="3" />
      </value-group>
      <value-group name="CTRLB__CHEDIS">
        <value name="ENABLE" caption="Cache Enabled; Accesses to flash use AUTOWS/FSW selection." value="0" />
        <value name="DISABLE" caption="Cache Disabled; Interface uses RDBUFWS selection." value="1" />
      </value-group>
      <value-group name="CTRLB__PREFDIS">
        <value name="ENABLE" caption="Predictive Prefetch Enabled" value="0" />
        <value name="DISABLE" caption="Predictive Prefetch Disabled" value="1" />
      </value-group>
      <value-group name="INTENCLR__SERR">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENCLR__CRCDONE">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENCLR__CRCERR">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENCLR__FLTCAP">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENSET__SERR">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENSET__CRCDONE">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENSET__CRCERR">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTENSET__FLTCAP">
        <value name="0" caption="Interrupt Disabled" value="0" />
        <value name="1" caption="Interrupt Enabled" value="1" />
      </value-group>
      <value-group name="INTFLAG__SERR">
        <value name="0" caption="No Interrupt Pending" value="0" />
        <value name="1" caption="SECCNT Count reached" value="1" />
      </value-group>
      <value-group name="INTFLAG__CRCDONE">
        <value name="0" caption="No Interrupt Pending" value="0" />
        <value name="1" caption="Calculation Done" value="1" />
      </value-group>
      <value-group name="INTFLAG__CRCERR">
        <value name="0" caption="No Interrupt Pending" value="0" />
        <value name="1" caption="CRCACC Is Not Equal to the XOR of CRCSUM and CRCFXOR" value="1" />
      </value-group>
      <value-group name="INTFLAG__FLTCAP">
        <value name="0" caption="No Interrupt Pending" value="0" />
        <value name="1" caption="An ECC Fault Capture, related to FLTMD[], occurred" value="1" />
      </value-group>
      <value-group name="INTFLAGSET__SERR">
        <value name="0" caption="No Interrupt Pending" value="0" />
        <value name="1" caption="SECCNT Count reached" value="1" />
      </value-group>
      <value-group name="INTFLAGSET__CRCDONE">
        <value name="0" caption="No effect" value="0" />
        <value name="1" caption="Set Interrupt Pending" value="1" />
      </value-group>
      <value-group name="INTFLAGSET__CRCERR">
        <value name="0" caption="No effect" value="0" />
        <value name="1" caption="Set Interrupt Pending" value="1" />
      </value-group>
      <value-group name="INTFLAGSET__FLTCAP">
        <value name="0" caption="No effect" value="0" />
        <value name="1" caption="Set Interrupt Pending" value="1" />
      </value-group>
      <value-group name="STATUS__PRM">
        <value name="0" caption="Flash is Ready (for read or NVMOP)" value="0" />
        <value name="1" caption="Flash is Powered Down and wakes on first access (read or NVMOP)" value="1" />
      </value-group>
      <value-group name="DBGCTRL__CRCRUN">
        <value name="HALT" caption="CRC Logic Halts in Debug Mode" value="0" />
        <value name="RUN" caption="CRC Logic Runs in Debug Mode." value="1" />
      </value-group>
      <value-group name="DBGCTRL__DBGECC">
        <value name="NOERR" caption="Corrected per ECCCTRL; No Bus ERR; INTFLAG, SEC counter, and FLT logic are not updated." value="0" />
        <value name="DISABLE" caption="Not corrected; No Bus Error; INTFLAG, SEC counter, and FLT logic are not updated." value="1" />
        <value name="ENABLE" caption="Corrected per ECCCTRL; Bus Error, INTFLAG, SEC counter, and FLT logic operates as setup." value="2" />
        <value name="RSVD11" caption="Don't use but same as 01 (DISABLE)" value="3" />
      </value-group>
