zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00100.atdf
      <value-group name="CFGA__DIVREF">
        <value name="DIV1" caption="The reference clock is divided by 1" value="0x0" />
        <value name="DIV8" caption="The reference clock is divided by 8" value="0x1" />
      </value-group>
      <value-group name="CTRLC__WINMODE">
        <value name="DISABLE" caption="No window mode (default)" value="0x0" />
        <value name="MODE1" caption="VALUE &gt; WINLT" value="0x1" />
        <value name="MODE2" caption="VALUE &lt; WINUT" value="0x2" />
        <value name="MODE3" caption="WINLT &lt; VALUE &lt; WINUT" value="0x3" />
        <value name="MODE4" caption="!(WINLT &lt; VALUE &lt; WINUT)" value="0x4" />
      </value-group>
    </module>
    <module name="FUSES" id="fuses" name2="fuses" version="1a0" caption="Defines FUSES module data">
      <register-group name="FUSES_ROMCFG" caption="Defines FUSES module data">
        <register name="DAL" offset="0x0" rw="RW" size="4" caption="DEVICE ACCESS LEVEL Register">
          <bitfield name="DAL_CPU" caption="CPU Device Access Level" mask="0xFFFFFFFF" />
        </register>
        <register name="FRCFGBROM" offset="0x400" rw="RW" size="4" caption="PRE-BOOT bromc user Options Register">
          <bitfield name="BCRCDIS" caption="Boot ROM CRC Disable" mask="0x1" />
        </register>
        <register name="FRCFGMBIST" offset="0x408" rw="RW" size="4" caption="PRE-BOOT MBIST user Options Register">
          <bitfield name="MOBH" caption="MBIST On Boot Enable for HIBERNATE Only Retaining Memory Groups" mask="0xC" values="FRCFGMBIST__MOBH" />
          <bitfield name="MOBB" caption="MBIST On Boot Enable for BACKUP/HIBERNATE Retaining Memory Groups" mask="0x30" values="FRCFGMBIST__MOBB" />
</register>
            <register name="KEYVAL_INTCHK0" offset="0x420" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_INTCHK0" caption="" mask="0xFFFFFFFF" />
            </register>
            <register name="KEYVAL_INTCHK1" offset="0x424" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_INTCHK1" caption="" mask="0xFFFFFFFF" />
            </register>
            <register name="KEYVAL_INTCHK2" offset="0x428" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_INTCHK2" caption="" mask="0xFFFFFFFF" />
            </register>
            <register name="KEYVAL_INTCHK3" offset="0x42C" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_INTCHK3" caption="" mask="0xFFFFFFFF" />
            </register>
            <register name="KEYVAL_INTCHK4" offset="0x430" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_INTCHK4" caption="" mask="0xFFFFFFFF" />
            </register>
            <register name="KEYVAL_INTCHK5" offset="0x434" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_INTCHK5" caption="" mask="0xFFFFFFFF" />
            </register>
            <register name="KEYVAL_INTCHK6" offset="0x438" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_INTCHK6" caption="" mask="0xFFFFFFFF" />
            </register>
            <register name="KEYVAL_INTCHK7" offset="0x43C" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_INTCHK7" caption="" mask="0xFFFFFFFF" />
            </register>
            <register name="KEYVAL_CE_ALL0" offset="0x440" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_ALL0" caption="" mask="0xFFFFFFFF" />
            </register>
            <register name="KEYVAL_CE_ALL1" offset="0x444" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_ALL1" caption="" mask="0xFFFFFFFF" />
            </register>
            <register name="KEYVAL_CE_ALL2" offset="0x448" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_ALL2" caption="" mask="0xFFFFFFFF" />
            </register>
            <register name="KEYVAL_CE_ALL3" offset="0x44C" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_ALL3" caption="" mask="0xFFFFFFFF" />
            </register>
            <register name="KEYVAL_CE_ALL4" offset="0x450" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_ALL4" caption="" mask="0xFFFFFFFF" />
            </register>
            <register name="KEYVAL_CE_ALL5" offset="0x454" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_ALL5" caption="" mask="0xFFFFFFFF" />
            </register>
            <register name="KEYVAL_CE_ALL6" offset="0x458" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_ALL6" caption="" mask="0xFFFFFFFF" />
            </register>
            <register name="KEYVAL_CE_ALL7" offset="0x45C" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_ALL7" caption="" mask="0xFFFFFFFF" />
            </register>
            <register name="KEYVAL_CE_S_CR0" offset="0x460" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_S_CR0" caption="" mask="0xFFFFFFFF" />
            </register>
            <register name="KEYVAL_CE_S_CR1" offset="0x464" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_S_CR1" caption="" mask="0xFFFFFFFF" />
            </register>
            <register name="KEYVAL_CE_S_CR2" offset="0x468" rw="RW" size="4" initval="0xFFFFFFFF" caption="Mapped Fuse Register">
            <bitfield name="KEYVAL_CE_S_CR2" caption="" mask="0xFFFFFFFF" />
            </register>
