zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00100.atdf
            <register name="FCR_ECCCTRL" offset="0x884" rw="RW" size="4" initval="0x00000070" caption="ECC Control REGISTER">
            <bitfield name="ECCCTL" caption="NVM ECC Mode Control - restricts one or more NVMOPs" mask="0x30" values="FCR_ECCCTRL__ECCCTL" />
            <bitfield name="ECCUNLCK" caption="NVM ECC Mode Control Unlock" mask="0x40" values="FCR_ECCCTRL__ECCUNLCK" />
            <bitfield name="SECCNT" caption="Flash SEC Count" mask="0xFF00" />
            </register>
            <register name="SUPC_BRCFGUSMOR_BOR" offset="0x888" rw="RW" size="4" initval="0x00000000" caption="Boot Rom Configurable SMOR User CFG BOR register">
            <bitfield name="HYST_BOR_VDDIO" caption="Refer to pwr_smor_[nn]_v2 DOS document for details." mask="0x1" values="SUPC_BRCFGUSMOR_BOR__HYST_BOR_VDDIO" />
            <bitfield name="BOR_TRIP_VDDIO" caption="Nominal BOR Trip, Refer to pwr_smor_[nn]_v2 DOS document for details." mask="0x6" values="SUPC_BRCFGUSMOR_BOR__BOR_TRIP_VDDIO" />
            <bitfield name="HYST_BOR_VDDREG" caption="Refer to pwr_smor_[nn]_v2 DOS document for details." mask="0x400" values="SUPC_BRCFGUSMOR_BOR__HYST_BOR_VDDREG" />
            </register>
            <register name="SUPC_BRCFGUDSSMOR" offset="0x890" rw="RW" size="4" initval="0x00000000" caption="Boot Rom Configurable DSSMOR User CFG register">
            <bitfield name="BOR_HYST" caption="Refer to pwr_smor_ds_[nn]_v2 DOS document for details." mask="0x1" values="SUPC_BRCFGUDSSMOR__BOR_HYST" />
            <bitfield name="BOR_TRIP" caption="Nominal BOR Trip, Refer to pwr_smor_ds_[nn]_v2 DOS document for details." mask="0x6" values="SUPC_BRCFGUDSSMOR__BOR_TRIP" />
            </register>
            <register name="SUPC_BRCFGUCP0" offset="0x894" rw="RW" size="4" initval="0x00000001" caption="Boot Rom Configurable CHARGE PUMP User CFG register">
            <bitfield name="CP" caption="Refer to vreg_chrg_pump_v4 DOS document for details." mask="0xF" values="SUPC_BRCFGUCP0__CP" />
            </register>
            <register name="WDT_SETUP" offset="0x898" rw="RW" size="4" initval="0x00000000" caption="">
            <bitfield name="ENABLE" caption="Enable" mask="0x2" />
            <bitfield name="WEN" caption="Watchdog Timer Window Mode Enable" mask="0x4" />
            <bitfield name="RUNSTDBY" caption="Run During Standby" mask="0x40" />
            <bitfield name="ALWAYSON" caption="Always-On" mask="0x80" />
            <bitfield name="PER" caption="Time-Out Period" mask="0xF00" values="WDT_SETUP__PER" />
            <bitfield name="WINDOW" caption="Window Mode Time-Out Period" mask="0xF000" values="WDT_SETUP__WINDOW" />
            <bitfield name="EWOFFSET" caption="Early Warning Interrupt Time Offset" mask="0xF0000" values="WDT_SETUP__EWOFFSET" />        </register>
      </register-group>
      <register-group name="FUSES_CALOTP" caption="Defines FUSES module data">
        <register name="F1RR" offset="0x0" rw="R" size="4" caption="PANEL 0 REDUNDANCY RECORD 1-0 Register">
          <bitfield name="RR0ADDR" caption="Redundancy Replaced Page Address" mask="0x7F" />
          <bitfield name="RR0DIS" caption="Redundancy Record 0 enabled" mask="0x8000" values="F1RR__RR0DIS" />
          <bitfield name="RR1ADDR" caption="Redundancy Replaced Page Address" mask="0x7F0000" />
          <bitfield name="RR1DIS" caption="Redundancy Record 1 enabled" mask="0x80000000" values="F1RR__RR1DIS" />
        </register>
        <register name="FCCFG0" offset="0x80" rw="R" size="4" caption="Calibration Configuration 0 Register">
          <bitfield name="CFG_SMOR0" caption="SMOR configuration bits" mask="0xFFFFFFFF" />
        </register>
        <register name="FCCFG1" offset="0x84" rw="R" size="4" caption="Calibration Configuration 1 Register">
          <bitfield name="CFG_SMOR1" caption="SMOR configuration bits" mask="0xFFFFFFFF" />
        </register>
        <register name="FCCFG8" offset="0xA0" rw="R" size="4" caption="Calibration Configuration 8 Register">
          <bitfield name="CFG_DS_SMOR_REF" caption="DSSMOR configuration bits" mask="0xFFFF" />
          <bitfield name="CFG_DS_SMOR_CLK" caption="DSSMOR configuration bits" mask="0xFFFF0000" />
        </register>
        <register name="FCCFG16" offset="0xC0" rw="R" size="4" caption="Calibration Configuration 16 Register">
          <bitfield name="CFG_DFLL48M" caption="Comparator configuration bits" mask="0xFFFFFFFF" />
        </register>
        <register name="FCCFG17" offset="0xC4" rw="R" size="4" caption="Calibration Configuration 17 Register">
          <bitfield name="CFG_XTAL_HF" caption="Crystal Oscillator calibration configuration bits" mask="0xFFFF" />
        </register>
        <register name="FCCFG24" offset="0xE0" rw="R" size="4" caption="Calibration Configuration 24 Register">
          <bitfield name="CFG_CALVREGSW0" caption="99 ma VREG Calibration configuration bits" mask="0xFFFF" />
        </register>
        <register name="FCCFG27" offset="0xEC" rw="R" size="4" caption="Calibration Configuration 27 Register">
          <bitfield name="CFG_CALVREGRAM" caption="50 ma VREG Calibration configuration bits" mask="0xFFFF0000" />
        </register>
        <register name="FCCFG28" offset="0xF0" rw="R" size="4" caption="Calibration Configuration 28 Register">
          <bitfield name="CALCP" caption="Charge Pump Calibration  configuration bits for all charge pumps" mask="0xF" />
          <bitfield name="CALSUPC" caption="RPMU / SUPC configuration bits" mask="0xFF00" />
        </register>
        <register name="FCCFG29" offset="0xF4" rw="R" size="4" caption="Calibration Configuration 29 Register">
          <bitfield name="CALUSERLDO" caption="User LDO Calibration  configuration bits" mask="0xFF" />
        </register>
        <register name="FCCFG32" offset="0x100" rw="R" size="4" caption="DSU Device Configuration 0 Register (DEVID)">
          <bitfield name="PFM_SZ" caption="Program Flash Memory (PFM) Size on Device" mask="0xF" values="FCCFG32__PFM_SZ" />
          <bitfield name="DRM_SZ" caption="Data Ram Memory (DRM) Size on Device" mask="0xFF00" values="FCCFG32__DRM_SZ" />
          <bitfield name="FPACKAGE" caption="Number of Pins present on the Package" mask="0xF0000" values="FCCFG32__FPACKAGE" />
          <bitfield name="DEVSEL" caption="Device Variant Configuration" mask="0xFF000000" />
        </register>
