zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00100.atdf
        <register name="RNG_Control_Registers__InitWaitVal" offset="0x11034" rw="RW" size="4" initval="0x0000FFFF" caption="Initial wait counter value.">
          <bitfield name="InitWaitVal" caption="Number of clock cycles to wait before sampling data from the noise source." mask="0xFFFF" />
        </register>
        <register name="RNG_Control_Registers__DisableOsc0" offset="0x11038" rw="RW" size="4" initval="0x00000000" caption="Disable oscillator rings #0 to #31.">
          <bitfield name="DisableOsc0" caption="Disable oscillator rings #0 to #31." mask="0xFFFFFFFF" />
        </register>
        <register name="RNG_Control_Registers__DisableOsc1" offset="0x1103C" rw="RW" size="4" initval="0x00000000" caption="Disable oscillator rings #32 to #63.">
          <bitfield name="DisableOsc1" caption="Disable oscillator rings #32 to #63." mask="0xFFFFFFFF" />
        </register>
        <register name="RNG_Control_Registers__SwOffTmrVal" offset="0x11040" rw="RW" size="4" initval="0x0000FFFF" caption="Switch off timer value.">
          <bitfield name="SwOffTmrVal" caption="Number of clk cycles to wait before stopping the rings after the FIFO is full." mask="0xFFFF" />
        </register>
        <register name="RNG_Control_Registers__ClkDiv" offset="0x11044" rw="RW" size="4" initval="0x00000000" caption="Sample clock divider.">
          <bitfield name="ClkDiv" caption="Sample clock divider. The frequency at which the outputs of the rings are sampled is given by: Fs=Fpclk/(ClkDiv+1)." mask="0xFF" />
        </register>
        <register name="RNG_Control_Registers__AIS31Conf0" offset="0x11048" rw="RW" size="4" initval="0x00000000" caption="AIS31 configuration register 0.">
          <bitfield name="StartUpThreshold" caption="Start-up test threshold." mask="0xFFFF" />
          <bitfield name="OnlineThreshold" caption="Online threshold." mask="0xFFFF0000" />
        </register>
        <register name="RNG_Control_Registers__AIS31Conf1" offset="0x1104C" rw="RW" size="4" initval="0x00000000" caption="AIS31 configuration register 1.">
          <bitfield name="OnlineRepThreshold" caption="Online repeat threshold." mask="0xFFFF" />
          <bitfield name="HExpectedValue" caption="Expected history value." mask="0xFFFF0000" />
        </register>
        <register name="RNG_Control_Registers__AIS31Conf2" offset="0x11050" rw="RW" size="4" initval="0x00000000" caption="AIS31 configuration register 2.">
          <bitfield name="HMin" caption="Minimum allowed history value." mask="0xFFFF" />
          <bitfield name="HMa" caption="Maximum allowed history value." mask="0xFFFF0000" />
        </register>
        <register name="RNG_Control_Registers__AIS31Status" offset="0x11054" rw="RW" size="4" initval="0x00000000" caption="AIS31 status register.">
          <bitfield name="NumPrelimAlarms" caption="Number of preliminary noise alarms since counter was last cleared." mask="0xFFFF" />
          <bitfield name="PrelimNoiseAlarmRng" caption="Last preliminary noise alarm occurred due to history value out of range." mask="0x10000" />
          <bitfield name="PrelimNoiseAlarmRep" caption="Last preliminary noise alarm occurred due to consecutive high X**2." mask="0x20000" />
        </register>
        <register name="RNG_Control_Registers__HwConfig" offset="0x11058" rw="R" size="4" initval="0x00000037" caption="Hardware configuration register.">
          <bitfield name="NumbOfRings" caption="Generic g_NumRings value." mask="0xFF" />
          <bitfield name="AIS31" caption="Generic g_AIS31 value." mask="0x100" />
          <bitfield name="AIS31Full" caption="Generic g_AIS31Full value." mask="0x200" />
        </register>
        <register name="PK_Registers__Pointers" offset="0x12000" rw="RW" size="4" initval="0x00000000" caption="Pointers register.">
          <bitfield name="OpPtrA" caption="When executing primitive arithmetic operations, this pointer defines where operand A is located in memory (location 0x0 to 0xF)." mask="0xF" />
          <bitfield name="OpPtrB" caption="When executing primitive arithmetic operations, this pointer defines where operand B is located in memory (location 0x0 to 0xF)." mask="0xF00" />
          <bitfield name="OpPtrC" caption="When executing primitive arithmetic operations, this pointer defines the location (0x0 to 0xF) where the result will be stored in memory." mask="0xF0000" />
          <bitfield name="OpPtrN" caption="When executing primitive arithmetic operations, this pointer defines the location where the modulus is located in memory (location 0x0 to 0xF)." mask="0xF000000" />
        </register>
        <register name="PK_Registers__Command" offset="0x12004" rw="RW" size="4" initval="0x0000000F" caption="Command register.">
          <bitfield name="OpeAddr" caption="This field defines the operation to be performed. See documentation for more details." mask="0x7F" />
          <bitfield name="FieldF" caption="'0': Field is GF(p) '1': Field is GF(2**m)" mask="0x80" />
          <bitfield name="OpBytesM1" caption="This field defines the size (= number of bytes minus one) of the operands for the current operation. Possible values are limited by the maximum supported operand size. Examples: - 0x014 -&gt; ECC on curve K-163 - 0x01F -&gt; ECC on curve P-256 - 0x02F -&gt; ECC on curve P-384 - 0x033 -&gt; ECC on curve K-409 - 0x041 -&gt; ECC on curve P-521 - 0x07F -&gt; 1024-bit RSA - 0x09F -&gt; 1280-bit RSA - 0x1FF -&gt; 4096-bit RSA - 0x3FF -&gt; 8192-bit RSA" mask="0x3FF00" />
          <bitfield name="RandMod" caption="Enable randomization of modulus (counter-measure)." mask="0x80000" />
          <bitfield name="SelCurve" caption="Enable accelerator for specific curve modulus: 0x0: No acceleration (default) 0x1: P256 0x2: P384 0x3: P521 0x4: P192 0x5: Curve25519 0x6: Ed25519 This field has no effect when the optional acceleration hardware is not included." mask="0x700000" />
          <bitfield name="RandKE" caption="Enable randomization of exponent/scalar (counter-measure)." mask="0x1000000" />
          <bitfield name="RandProj" caption="Enable randomization of projective coordinates (counter-measure)." mask="0x2000000" />
          <bitfield name="Edwards" caption="Enable Edwards curve (see operation description)." mask="0x4000000" />
          <bitfield name="SwapBytes" caption="Swap the bytes on AHB interface: '0': Native format (little endian) '1': Byte swapped (big endian) See also section 4.2.1. This bit must be programmed before writing/reading any data in data memory." mask="0x10000000" />
          <bitfield name="FlagA" caption="See operation description." mask="0x20000000" />
          <bitfield name="FlagB" caption="See operation description." mask="0x40000000" />
          <bitfield name="CalcR2" caption="This bit indicates if the IP has to calculate R**2 mod N for the next operation. This bit must be set to '1' when a new prime number has been programmed. This bit is used for primitive operations and ignored for the other operations. '0': don't recalculate R**2 mod N '1': re-calculate R**2 mod N" mask="0x80000000" />
        </register>
        <register name="PK_Registers__Control" offset="0x12008" rw="W" size="4" initval="0x00000000" caption="Command register.">
          <bitfield name="Start" caption="Writing a '1' starts the processing." mask="0x1" />
          <bitfield name="ClearIRQ" caption="Writing a '1' clears the IRQ output." mask="0x2" />
        </register>
        <register name="PK_Registers__Status" offset="0x1200C" rw="R" size="4" initval="0x00000000" caption="Status register.">
          <bitfield name="ErrorFlags" caption="These bits indicate an error condition. They are updated at the end of the operation. They are cleared when starting a new operation. See documentation for more details." mask="0xFFF0" />
          <bitfield name="PK_Busy" caption="This bit reflects the BUSY output value. It is set when the operation starts and it is cleared when the operation is finished." mask="0x10000" />
          <bitfield name="IntrptStatus" caption="This bit reflects the IRQ output value. It is set when the operation is finished. It is cleared when the CPU writes the bit 1 of Control Register." mask="0x20000" />
          <bitfield name="FailPtr" caption="These bits indicate which data location generated the error flag. They are not available for all error flags." mask="0x1F000000" />
        </register>
        <register name="PK_Registers__Timer" offset="0x12014" rw="RW" size="4" initval="0x00000000" caption="Timer register.">
          <bitfield name="Timer" caption="Number of core clock cycles." mask="0xFFFFFFFE" />
        </register>
        <register name="PK_Registers__HwConfig" offset="0x12018" rw="R" size="4" initval="0x43F30200" caption="Hardware configuration register.">
          <bitfield name="MaxOpSize" caption="Maximum operand size (number of bytes)." mask="0xFFF" />
          <bitfield name="NbMult" caption="Number of multipliers: 0x0: 1 multiplier 0x1: 4 multipliers 0x2: 16 multipliers 0x4: 64 multipliers 0x8: 256 multipliers" mask="0xF000" />
          <bitfield name="PrimeField" caption="Support prime field." mask="0x10000" />
          <bitfield name="BinaryField" caption="Support binary field." mask="0x20000" />
          <bitfield name="ECC" caption="Support RAM error correction." mask="0x40000" />
          <bitfield name="P256" caption="Support ECC P256 acceleration." mask="0x100000" />
          <bitfield name="P384" caption="Support ECC P384 acceleration." mask="0x200000" />
          <bitfield name="P521" caption="Support ECC P521 acceleration." mask="0x400000" />
          <bitfield name="P192" caption="Support ECC P192 acceleration." mask="0x800000" />
          <bitfield name="X25519" caption="Support Curve25519/Ed25519 acceleration." mask="0x1000000" />
          <bitfield name="AHBMaster" caption="'0': Memory access through AHB Slave and internally in the PKE.                                                                             '1': Memory access through AHB Master, outside the PKE." mask="0x2000000" />
          <bitfield name="DisableSM" caption="State of DisableSMx input (high when SM2/SM9 operations are disabled)." mask="0x20000000" />
          <bitfield name="DisableClrMem" caption="State of DisableClrMem input (high when automatic clear of the RAM after reset is disabled)." mask="0x40000000" />
          <bitfield name="DisableCM" caption="State of DisableCM input (high when counter-measures are disabled)." mask="0x80000000" />
        </register>
        <register name="PK_Registers__OpSize" offset="0x1201C" rw="RW" size="4" initval="0x00001000" caption="Operand size register.">
          <bitfield name="OpSize" caption="Operand size (number of bytes): 0x0100: 256 0x0209: 521 0x0800: 2048 0x0C00: 3072 0x1000: 4096 This register is used when the memory is accessed via AHB Master" mask="0x1FFF" />
        </register>
