zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00100.atdf
        <register name="POLCTRL1" offset="0x40" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Polarity Control 1 Register">
          <bitfield name="POLARITY" caption="Choose X/Y lines Polarity [31:0]" mask="0xFFFFFFFF" />
        </register>
        <register name="POLCTRL2" offset="0x44" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Polarity Control 2 Register">
          <bitfield name="POLARITY" caption="Choose X/Y lines Polarity [63:32]" mask="0xF" />
        </register>
        <register name="INTENCLR" offset="0x48" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="INTERRUPT ENABLE CLEAR Register">
          <bitfield name="EOC" caption="End of Conversion Enable Clear." mask="0x1" />
          <bitfield name="WCOMP" caption="Window Comparator Enable Clear." mask="0x2" />
          <bitfield name="ACRRDY" caption="Analog Core Ready Enable Clear." mask="0x80" />
        </register>
        <register name="INTENSET" offset="0x4C" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="INTERRUPT ENABLE SET Register">
          <bitfield name="EOC" caption="End of Conversion Enable Set." mask="0x1" />
          <bitfield name="WCOMP" caption="Window Comparator Enable Set." mask="0x2" />
          <bitfield name="ACRRDY" caption="Analog Core Ready Enable Set." mask="0x80" />
        </register>
        <register name="INTFLAGSET" offset="0x50" rw="RW" size="4" atomic-op="clear:INTFLAGSET" initval="0x00000000" caption="INTERRUPT FLAG SET Register">
          <bitfield name="EOC" caption="End of Conversion Enable Set." mask="0x1" />
          <bitfield name="WCOMP" caption="Window Comparator Enable Set." mask="0x2" />
          <bitfield name="ACRRDY" caption="Analog Core Ready Enable Set." mask="0x80" />
        </register>
        <register name="INTFLAG" offset="0x54" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="INTERRUPT FLAG STATUS and CLEAR Register">
          <bitfield name="EOC" caption="End of Conversion Flag" mask="0x1" />
          <bitfield name="WCOMP" caption="Window Comparator Flag" mask="0x2" />
          <bitfield name="ACRRDY" caption="Analog Core Ready Flag" mask="0x80" />
        </register>
        <register name="STATUS" offset="0x58" rw="R" size="4" initval="0x00000000" caption="STATUS Register">
          <bitfield name="PTCBUSY" caption="PTC Busy Status" mask="0x1" />
          <bitfield name="DAD" caption="Digital Accumulation Done" mask="0x80" />
          <bitfield name="WCC" caption="Window Comparator Counter" mask="0x7F00" />
        </register>
        <register name="SYNCBUSY" offset="0x5C" rw="R" size="4" initval="0x00000000" caption="Synchronization Register">
          <bitfield name="SWRST" caption="SWRST Synchronization Busy --- Synchronizing Busy bit for swrst" mask="0x1" />
          <bitfield name="ENABLE" caption="ENABLE Synchronization Busy" mask="0x2" />
          <bitfield name="CTRLB" caption="Control B Synchronization Busy" mask="0x4" />
          <bitfield name="CTRLC" caption="Control C Synchronization Busy" mask="0x8" />
          <bitfield name="CTRLD" caption="Control D Synchronization Busy" mask="0x10" />
          <bitfield name="SWTRIG" caption="Software Trigger Synchronization Busy" mask="0x20" />
          <bitfield name="WINLT" caption="Window Comparator Low Threshold Synchronization Busy" mask="0x40" />
          <bitfield name="WINHT" caption="Window Comparator High Threshold Synchronization Busy" mask="0x80" />
          <bitfield name="XSEL1" caption="X-lines Selection 1 Synchronization Busy" mask="0x100" />
          <bitfield name="XSEL2" caption="X-lines Selection 2 Synchronization Busy" mask="0x200" />
          <bitfield name="YSEL1" caption="Y-lines Selection 1 Synchronization Busy" mask="0x400" />
          <bitfield name="YSEL2" caption="Y-lines Selection 2 Synchronization Busy" mask="0x800" />
          <bitfield name="POLCTRL1" caption="Polarity Control 1 Synchronization Busy" mask="0x1000" />
          <bitfield name="POLCTRL2" caption="Polarity Control 2 Synchronization Busy" mask="0x2000" />
        </register>
        <register name="DSEQCTRL" offset="0x60" rw="RW" size="4" initval="0x00000000" caption="DMA SEQUENCE CTRL Register">
          <bitfield name="CTRLD" caption="Control D." mask="0x1" />
          <bitfield name="WINLT" caption="Window Comparator Low Threshold" mask="0x2" />
          <bitfield name="WINHT" caption="Window Comparator High Threshold" mask="0x4" />
          <bitfield name="XSEL" caption="X-line n Selection lower/upper half word" mask="0x78" />
          <bitfield name="YSEL" caption="Y-line n Selection lower/uper half word" mask="0x780" />
          <bitfield name="POL" caption="Polarity n lower/upper half word" mask="0x7800" />
          <bitfield name="CC" caption="Compensation Capacitor" mask="0x8000" />
          <bitfield name="CI" caption="Integration Capacitor" mask="0x10000" />
          <bitfield name="CSD" caption="Charge Share Delay" mask="0x20000" />
          <bitfield name="AUTOSTART" caption="PTC Auto-Start Conversion." mask="0x80000000" />
        </register>
        <register name="DSEQSTAT" offset="0x64" rw="R" size="4" initval="0x00000000" caption="DMA SEQUENCE STATUS - Register">
          <bitfield name="CTRLD" caption="Control D." mask="0x1" />
          <bitfield name="WINLT" caption="Window Comparator Low Threshold" mask="0x2" />
          <bitfield name="WINHT" caption="Window Comparator High Threshold" mask="0x4" />
          <bitfield name="XSEL" caption="X-line n  Selection lower/upper half word" mask="0x78" />
          <bitfield name="YSEL" caption="Y-line n Selection lower/upper half word" mask="0x780" />
          <bitfield name="POL" caption="Polarity n lower/upper half word" mask="0x7800" />
          <bitfield name="CC" caption="Compensation Capacitor" mask="0x8000" />
          <bitfield name="CI" caption="Integration Capacitor" mask="0x10000" />
          <bitfield name="CSD" caption="Charge Share Delay" mask="0x20000" />
          <bitfield name="BUSY" caption="Sequencing Busy" mask="0x80000000" />
        </register>
        <register name="DSEQDATA" offset="0x68" rw="W" size="4" initval="0x00000000" caption="DMA SEQUENCE DATA - Register">
          <bitfield name="DATA" caption="DMA Sequential Data." mask="0xFFFFFFFF" />
        </register>
        <register name="RESULT" offset="0x6C" rw="R" size="4" initval="0x00000000" caption="Register">
          <bitfield name="RES" caption="Result Conversion Value." mask="0xFFF" />
          <bitfield name="ACCRES" caption="Accumulated Result Conversion Value." mask="0xFFFF0000" />
        </register>
      </register-group>
