zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00100.atdf
      <value-group name="CTRLA__SWRST">
        <value name="0" caption="There is no reset operation ongoing" value="0" />
        <value name="1" caption="The reset operation is ongoing" value="1" />
      </value-group>
      <value-group name="CTRLA__ENABLE">
        <value name="0" caption="Disable module. System clock is only requested for bus transactions. GCLK is never requested." value="0" />
        <value name="1" caption="Enable module by allowing both the generic clock and system clock requests based on the incoming clock requests from the SIB." value="1" />
      </value-group>
    </module>
    <module name="PUF" id="04891" name2="sec_puf_v1" version="1a0" caption="Physically Unclonable Function">
      <register-group name="PUF" caption="Physically Unclonable Function">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control Register A">
          <bitfield name="SWRST" caption="Software ResetNOTE: Reset to PUF must be held active long enough to reset complete macro." mask="0x1" values="CTRLA__SWRST" />
          <bitfield name="ENABLE" caption="Clock Enable bit" mask="0x2" values="CTRLA__ENABLE" />
          <bitfield name="PRIV" caption="Privileged Access Only" mask="0x4" values="CTRLA__PRIV" />
          <bitfield name="RUNSTDBY" caption="RUNSTDBY Enable bit - not used by EIP HWWriting this register has no affect on the EIPNote: Currently this bit is present, but has no functionality. This bit is part of the IP wrapper but has no use for the EIP." mask="0x40" />
        </register>
        <register name="STATUSA" offset="0x38" rw="R" size="4" initval="0x00000000" caption="Status Register A">
          <bitfield name="BUSY" caption="PUF Busy indicator" mask="0x1" values="STATUSA__BUSY" />
        </register>
        <register name="DISABLE" offset="0x100" rw="RW" size="4" atomic-op="set:DISABLE" initval="0x00000000" caption="Disable Function Control Register">
          <bitfield name="ENROLL" caption="ENROLL Command Disable bit" mask="0x2" values="DISABLE__ENROLL" />
          <bitfield name="START" caption="START Command Disable bit" mask="0x4" values="DISABLE__START" />
          <bitfield name="RECONSTRUCT" caption="RECONSTRUCT Command Disable bit" mask="0x8" values="DISABLE__RECONSTRUCT" />
          <bitfield name="STOP" caption="STOP Command Disable bit" mask="0x20" values="DISABLE__STOP" />
          <bitfield name="GET_KEY" caption="GET_KEY Command Disable bit" mask="0x40" values="DISABLE__GET_KEY" />
          <bitfield name="UNWRAP" caption="UNWRAP Command Disable bit" mask="0x80" values="DISABLE__UNWRAP" />
          <bitfield name="WRAP_GEN_RAND" caption="WRAP_GENERATE_RANDOM Command Disable bit" mask="0x100" values="DISABLE__WRAP_GEN_RAND" />
          <bitfield name="WRAP" caption="WRAP Command Disable bit" mask="0x200" values="DISABLE__WRAP" />
          <bitfield name="GEN_RAND" caption="GENERATE_RANDOM Command Disable bit" mask="0x8000" values="DISABLE__GEN_RAND" />
          <bitfield name="SKIP_MEM_TEST" caption="SKIP_MEMORY TEST Command Control bit" mask="0x20000000" values="DISABLE__SKIP_MEM_TEST" />
          <bitfield name="TEST_MEM" caption="TEST_MEMORY Command Disable bit" mask="0x40000000" values="DISABLE__TEST_MEM" />
          <bitfield name="TEST_PUF" caption="TEST_PUF Command Disable bit" mask="0x80000000" values="DISABLE__TEST_PUF" />
        </register>
        <register name="RESTRICT0" offset="0x104" rw="RW" size="4" atomic-op="set:RESTRICT0" initval="0x00000000" caption="Restrict User Context 0 Control Register">
          <bitfield name="RESTRICT_CONTEXT_0" caption="Restrict User Context Writing a 1 in a bit position prevents other PUF keys to be generated with this context bit set. NOTE: Refer to the EIP datasheet for the function of the restrict_user_context signals" mask="0xFFFFFFFF" />
        </register>
        <register name="RESTRICT1" offset="0x108" rw="RW" size="4" atomic-op="set:RESTRICT1" initval="0x00000000" caption="Restrict User Context 1 Control Register">
          <bitfield name="RESTRICT_CONTEXT_1" caption="Restrict User Context Writing a 1 in a bit position prevents other PUF keys to be generated with this context bit set. NOTE: Refer to the EIP datasheet for the function of the restrict_user_context signals" mask="0xFFFFFFFF" />
        </register>
        <register name="CTRL_PWR" offset="0x10C" rw="RW" size="4" initval="0x00000000" caption="Power Control Register">
          <bitfield name="SRAM_PWRSW" caption="SRAM Power Switch Enable Bit" mask="0x1" values="CTRL_PWR__SRAM_PWRSW" />
        </register>
        <register name="CTRL_KEY" offset="0x110" rw="RW" size="4" initval="0x00000000" caption="KEY Control Register">
          <bitfield name="CLR_PUF_KEY" caption="Clear PUF Key Control Bit" mask="0x1" values="CTRL_KEY__CLR_PUF_KEY" />
        </register>
        <register name="QK_CR" offset="0x200" rw="RW" size="4" initval="0x00000000" caption="Control register; The Control register defines which command must be executed next. When the command is accepted or rejected, the bits automatically revert to 0. Only one command bit may be written with 1 at a time, with the exception of qk_zeroize. Writing qk_zeroize with 1 takes precedence over all other commands.">
          <bitfield name="qk_zeroize" caption="Begin Zeroize operation" mask="0x1" />
          <bitfield name="qk_enroll" caption="Begin Enroll operation" mask="0x2" />
          <bitfield name="qk_start" caption="Begin Start operation" mask="0x4" />
          <bitfield name="qk_reconstruct" caption="Begin Reconstruct operation" mask="0x8" />
          <bitfield name="qk_stop" caption="Begin Stop operation" mask="0x20" />
          <bitfield name="qk_get_key" caption="Begin Get Key operation" mask="0x40" />
          <bitfield name="qk_unwrap" caption="Begin Unwrap operation" mask="0x80" />
          <bitfield name="qk_wrap_generated_random" caption="Begin Wrap Generated Random operation" mask="0x100" />
          <bitfield name="qk_wrap" caption="Begin Wrap operation" mask="0x200" />
          <bitfield name="qk_generate_random" caption="Begin Generate Random operation" mask="0x8000" />
          <bitfield name="qk_test_memory" caption="Begin Test Memory operation" mask="0x40000000" />
          <bitfield name="qk_test_puf" caption="Begin Test PUF operation" mask="0x80000000" />
        </register>
        <register name="QK_ORR" offset="0x204" rw="R" size="4" initval="0x00000000" caption="Operation Result register; The Operation Result register provides the result code of the last operation (Initialization, Generate Random, etc.). The value in this register is only valid when qk_busy = 0.">
          <bitfield name="qk_result_code" caption="Result code of last operation" mask="0xFF" values="QK_ORR__qk_result_code" />
          <bitfield name="qk_last_operation" caption="Number of last operation" mask="0xFF000000" values="QK_ORR__qk_last_operation" />
        </register>
        <register name="QK_SR" offset="0x208" rw="RW" size="4" initval="0x00000001" caption="Status register; The Status register shows the current status of QuiddiKey and indicates whether a data transfer is requested.">
          <bitfield name="qk_busy" caption="Operation is in progress" mask="0x1" />
          <bitfield name="qk_ok" caption="Last operation was successful" mask="0x2" />
          <bitfield name="qk_error" caption="Last operation failed" mask="0x4" />
          <bitfield name="qk_zeroized" caption="QuiddiKey is in Zeroized or Locked state" mask="0x8" />
          <bitfield name="qk_rejected" caption="Read: Last command was rejected Write 1: Clears this bit" mask="0x10" />
          <bitfield name="qk_di_request" caption="Request for data in transfer via the QK_DIR register" mask="0x20" />
          <bitfield name="qk_do_request" caption="Request for data out transfer via the QK_DOR register" mask="0x40" />
        </register>
