zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00100.atdf
        <register name="DBGCTRL" offset="0xE" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Run During Debug" mask="0x1" />
        </register>
        <register modes="MODE0" name="SYNCBUSY" offset="0x10" rw="R" size="4" initval="0x00000000" caption="MODE0 Synchronization Busy Status">
          <bitfield name="SWRST" caption="Software Reset Busy" mask="0x1" />
          <bitfield name="ENABLE" caption="Enable Bit Busy" mask="0x2" />
          <bitfield name="FREQCORR" caption="FREQCORR Register Busy" mask="0x4" />
          <bitfield name="COUNT" caption="COUNT Register Busy" mask="0x8" />
          <bitfield name="COMP0" caption="COMP 0 Register Busy" mask="0x20" />
          <bitfield name="COMP1" caption="COMP 1 Register Busy" mask="0x40" />
          <bitfield name="COUNTSYNC" caption="Count Synchronization Enable Bit Busy" mask="0x8000" />
          <bitfield name="GP0" caption="General Purpose 0 Register Busy" mask="0x10000" />
          <bitfield name="GP1" caption="General Purpose 1 Register Busy" mask="0x20000" />
          <bitfield name="GP2" caption="General Purpose 2 Register Busy" mask="0x40000" />
          <bitfield name="GP3" caption="General Purpose 3 Register Busy" mask="0x80000" />
        </register>
        <register modes="MODE1" name="SYNCBUSY" offset="0x10" rw="R" size="4" initval="0x00000000" caption="MODE1 Synchronization Busy Status">
          <bitfield name="SWRST" caption="Software Reset Bit Busy" mask="0x1" />
          <bitfield name="ENABLE" caption="Enable Bit Busy" mask="0x2" />
          <bitfield name="FREQCORR" caption="FREQCORR Register Busy" mask="0x4" />
          <bitfield name="COUNT" caption="COUNT Register Busy" mask="0x8" />
          <bitfield name="PER" caption="PER Register Busy" mask="0x10" />
          <bitfield name="COMP0" caption="COMP 0 Register Busy" mask="0x20" />
          <bitfield name="COMP1" caption="COMP 1 Register Busy" mask="0x40" />
          <bitfield name="COMP2" caption="COMP 2 Register Busy" mask="0x80" />
          <bitfield name="COMP3" caption="COMP 3 Register Busy" mask="0x100" />
          <bitfield name="COUNTSYNC" caption="Count Synchronization Enable Bit Busy" mask="0x8000" />
          <bitfield name="GP0" caption="General Purpose 0 Register Busy" mask="0x10000" />
          <bitfield name="GP1" caption="General Purpose 1 Register Busy" mask="0x20000" />
          <bitfield name="GP2" caption="General Purpose 2 Register Busy" mask="0x40000" />
          <bitfield name="GP3" caption="General Purpose 3 Register Busy" mask="0x80000" />
        </register>
        <register modes="MODE2" name="SYNCBUSY" offset="0x10" rw="R" size="4" initval="0x00000000" caption="MODE2 Synchronization Busy Status">
          <bitfield name="SWRST" caption="Software Reset Bit Busy" mask="0x1" />
          <bitfield name="ENABLE" caption="Enable Bit Busy" mask="0x2" />
          <bitfield name="FREQCORR" caption="FREQCORR Register Busy" mask="0x4" />
          <bitfield name="CLOCK" caption="CLOCK Register Busy" mask="0x8" />
          <bitfield name="ALARM0" caption="ALARM 0 Register Busy" mask="0x20" />
          <bitfield name="ALARM1" caption="ALARM 1 Register Busy" mask="0x40" />
          <bitfield name="MASK0" caption="MASK 0 Register Busy" mask="0x800" />
          <bitfield name="MASK1" caption="MASK 1 Register Busy" mask="0x1000" />
          <bitfield name="CLOCKSYNC" caption="Clock Synchronization Enable Bit Busy" mask="0x8000" />
          <bitfield name="GP0" caption="General Purpose 0 Register Busy" mask="0x10000" />
          <bitfield name="GP1" caption="General Purpose 1 Register Busy" mask="0x20000" />
          <bitfield name="GP2" caption="General Purpose 2 Register Busy" mask="0x40000" />
          <bitfield name="GP3" caption="General Purpose 3 Register Busy" mask="0x80000" />
        </register>
        <register name="FREQCORR" offset="0x14" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Frequency Correction">
          <bitfield name="VALUE" caption="Correction Value" mask="0x7F" />
          <bitfield name="SIGN" caption="Correction Sign" mask="0x80" />
        </register>
        <register modes="MODE0" name="COUNT" offset="0x18" rw="RW" access="RSYNC" size="4" initval="0x00000000" caption="MODE0 Counter Value">
          <bitfield name="COUNT" caption="Counter Value" mask="0xFFFFFFFF" />
        </register>
        <register modes="MODE1" name="COUNT" offset="0x18" rw="RW" access="RSYNC" size="2" initval="0x0000" caption="MODE1 Counter Value">
          <bitfield name="COUNT" caption="Counter Value" mask="0xFFFF" />
        </register>
        <register modes="MODE2" name="CLOCK" offset="0x18" rw="RW" access="RSYNC" size="4" initval="0x00000000" caption="MODE2 Clock Value">
          <bitfield name="SECOND" caption="Second" mask="0x3F" />
          <bitfield name="MINUTE" caption="Minute" mask="0xFC0" />
          <bitfield name="HOUR" caption="Hour" mask="0x1F000" />
          <bitfield name="DAY" caption="Day" mask="0x3E0000" />
          <bitfield name="MONTH" caption="Month" mask="0x3C00000" />
          <bitfield name="YEAR" caption="Year" mask="0xFC000000" />
        </register>
        <register modes="MODE1" name="PER" offset="0x1C" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="MODE1 Counter Period">
          <bitfield name="PER" caption="Counter Period" mask="0xFFFF" />
        </register>
        <register modes="MODE0" name="COMP" offset="0x20" rw="RW" access="WSYNC" size="4" count="2" initval="0x00000000" caption="MODE0 Compare n Value">
          <bitfield name="COMP" caption="Compare Value" mask="0xFFFFFFFF" />
        </register>
        <register modes="MODE1" name="COMP" offset="0x20" rw="RW" access="WSYNC" size="2" count="4" initval="0x0000" caption="MODE1 Compare n Value">
          <bitfield name="COMP" caption="Compare Value" mask="0xFFFF" />
        </register>
        <register-group modes="MODE2" name="MODE2_ALARM" name-in-module="MODE2_ALARM" offset="0x20" size="0x8" count="2" />
        <register name="GP" offset="0x40" rw="RW" access="WSYNC" size="4" count="4" initval="0x00000000" caption="General Purpose">
          <bitfield name="GP" caption="General Purpose" mask="0xFFFFFFFF" />
        </register>
