zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/atdf/PIC32CM5112SG00100.atdf
        <register name="CONFIG" offset="0x1" rw="RW" size="1" initval="0xBB" caption="Configuration">
          <bitfield name="PER" caption="Time-Out Period" mask="0xF" values="CONFIG__PER" />
          <bitfield name="WINDOW" caption="Window Mode Time-Out Period" mask="0xF0" values="CONFIG__WINDOW" />
        </register>
        <register name="EWCTRL" offset="0x2" rw="RW" size="1" initval="0x0B" caption="Early Warning Interrupt Control">
          <bitfield name="EWOFFSET" caption="Early Warning Interrupt Time Offset" mask="0xF" values="EWCTRL__EWOFFSET" />
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="EW" caption="Early Warning Interrupt Enable" mask="0x1" />
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="EW" caption="Early Warning Interrupt Enable" mask="0x1" />
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="EW" caption="Early Warning" mask="0x1" />
        </register>
        <register name="SYNCBUSY" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="ENABLE" caption="Enable Synchronization Busy" mask="0x2" />
          <bitfield name="WEN" caption="Window Enable Synchronization Busy" mask="0x4" />
          <bitfield name="RUNSTDBY" caption="Run During Standby Synchronization Busy" mask="0x8" />
          <bitfield name="ALWAYSON" caption="Always-On Synchronization Busy" mask="0x10" />
          <bitfield name="CLEAR" caption="Clear Synchronization Busy" mask="0x20" />
        </register>
        <register name="CLEAR" offset="0xC" rw="W" access="WSYNC" size="1" initval="0x00" caption="Clear">
          <bitfield name="CLEAR" caption="Watchdog Clear" mask="0xFF" values="CLEAR__CLEAR" />
        </register>
      </register-group>
      <value-group name="CONFIG__PER">
        <value name="CYC8" caption="8 clock cycles" value="0x0" />
        <value name="CYC16" caption="16 clock cycles" value="0x1" />
        <value name="CYC32" caption="32 clock cycles" value="0x2" />
        <value name="CYC64" caption="64 clock cycles" value="0x3" />
        <value name="CYC128" caption="128 clock cycles" value="0x4" />
        <value name="CYC256" caption="256 clock cycles" value="0x5" />
        <value name="CYC512" caption="512 clock cycles" value="0x6" />
        <value name="CYC1024" caption="1024 clock cycles" value="0x7" />
        <value name="CYC2048" caption="2048 clock cycles" value="0x8" />
        <value name="CYC4096" caption="4096 clock cycles" value="0x9" />
        <value name="CYC8192" caption="8192 clock cycles" value="0xA" />
        <value name="CYC16384" caption="16384 clock cycles" value="0xB" />
      </value-group>
      <value-group name="CONFIG__WINDOW">
        <value name="CYC8" caption="8 clock cycles" value="0x0" />
        <value name="CYC16" caption="16 clock cycles" value="0x1" />
        <value name="CYC32" caption="32 clock cycles" value="0x2" />
        <value name="CYC64" caption="64 clock cycles" value="0x3" />
        <value name="CYC128" caption="128 clock cycles" value="0x4" />
        <value name="CYC256" caption="256 clock cycles" value="0x5" />
        <value name="CYC512" caption="512 clock cycles" value="0x6" />
        <value name="CYC1024" caption="1024 clock cycles" value="0x7" />
        <value name="CYC2048" caption="2048 clock cycles" value="0x8" />
        <value name="CYC4096" caption="4096 clock cycles" value="0x9" />
        <value name="CYC8192" caption="8192 clock cycles" value="0xA" />
        <value name="CYC16384" caption="16384 clock cycles" value="0xB" />
      </value-group>
      <value-group name="EWCTRL__EWOFFSET">
        <value name="CYC8" caption="8 clock cycles" value="0x0" />
        <value name="CYC16" caption="16 clock cycles" value="0x1" />
        <value name="CYC32" caption="32 clock cycles" value="0x2" />
        <value name="CYC64" caption="64 clock cycles" value="0x3" />
        <value name="CYC128" caption="128 clock cycles" value="0x4" />
        <value name="CYC256" caption="256 clock cycles" value="0x5" />
        <value name="CYC512" caption="512 clock cycles" value="0x6" />
        <value name="CYC1024" caption="1024 clock cycles" value="0x7" />
        <value name="CYC2048" caption="2048 clock cycles" value="0x8" />
        <value name="CYC4096" caption="4096 clock cycles" value="0x9" />
        <value name="CYC8192" caption="8192 clock cycles" value="0xA" />
        <value name="CYC16384" caption="16384 clock cycles" value="0xB" />
      </value-group>
      <value-group name="CLEAR__CLEAR">
        <value name="KEY" caption="Clear Key" value="0xA5" />
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="P100" caption="P100">
      <pin position="1" pad="PA00" />
      <pin position="2" pad="PA14" />
      <pin position="3" pad="PA01" />
      <pin position="4" pad="PA15" />
      <pin position="5" pad="PA02" />
      <pin position="6" pad="VSSIO1" />
      <pin position="7" pad="VDDIO" />
      <pin position="8" pad="PA10" />
      <pin position="9" pad="PA11" />
      <pin position="10" pad="PA12" />
      <pin position="11" pad="PA16" />
      <pin position="12" pad="PA17" />
      <pin position="13" pad="PA18" />
      <pin position="14" pad="PA03" />
      <pin position="15" pad="PA04" />
      <pin position="16" pad="PA05" />
      <pin position="17" pad="PA06" />
      <pin position="18" pad="PA13" />
      <pin position="19" pad="VDDIO" />
      <pin position="20" pad="VSSIO3" />
      <pin position="21" pad="PA07" />
      <pin position="22" pad="PA08" />
      <pin position="23" pad="PA09" />
      <pin position="24" pad="PA20" />
      <pin position="25" pad="PA19" />
      <pin position="26" pad="PB00" />
      <pin position="27" pad="PB07" />
      <pin position="28" pad="AVDD" />
      <pin position="29" pad="AVSS" />
      <pin position="30" pad="PB01" />
      <pin position="31" pad="PB02" />
      <pin position="32" pad="VDDIO" />
      <pin position="33" pad="VSSIO4" />
      <pin position="34" pad="VDDREG" />
      <pin position="35" pad="PB11" />
      <pin position="36" pad="PB12" />
      <pin position="37" pad="PB13" />
      <pin position="38" pad="PB14" />
      <pin position="39" pad="PB03" />
      <pin position="40" pad="PB04" />
      <pin position="41" pad="PB05" />
      <pin position="42" pad="PB08" />
      <pin position="43" pad="PB09" />
      <pin position="44" pad="PB06" />
      <pin position="45" pad="VSSIO5" />
      <pin position="46" pad="VDDIO" />
      <pin position="47" pad="PB15" />
      <pin position="48" pad="PB16" />
      <pin position="49" pad="PB17" />
      <pin position="50" pad="PB10" />
      <pin position="51" pad="PC00" />
      <pin position="52" pad="PC11" />
      <pin position="53" pad="PC12" />
      <pin position="54" pad="PC01" />
      <pin position="55" pad="PC13" />
      <pin position="56" pad="VDDIO" />
      <pin position="57" pad="VSSIO6" />
      <pin position="58" pad="PC02" />
      <pin position="59" pad="PC14" />
      <pin position="60" pad="PC15" />
      <pin position="61" pad="PC03" />
      <pin position="62" pad="PC16" />
      <pin position="63" pad="PC09" />
      <pin position="64" pad="PC04" />
      <pin position="65" pad="PC17" />
      <pin position="66" pad="PC10" />
      <pin position="67" pad="RESET_N" />
      <pin position="68" pad="VDDIO" />
      <pin position="69" pad="VSSIO7" />
      <pin position="70" pad="PC18" />
      <pin position="71" pad="PC19" />
      <pin position="72" pad="PC05" />
      <pin position="73" pad="PC06" />
      <pin position="74" pad="PC07" />
      <pin position="75" pad="PC08" />
      <pin position="76" pad="PD00" />
      <pin position="77" pad="PD10" />
      <pin position="78" pad="PD14" />
      <pin position="79" pad="PD11" />
      <pin position="80" pad="PD01" />
      <pin position="81" pad="VSSIO8" />
      <pin position="82" pad="VDDIO" />
      <pin position="83" pad="PD02" />
      <pin position="84" pad="PD03" />
      <pin position="85" pad="PD15" />
      <pin position="86" pad="PD16" />
      <pin position="87" pad="PD17" />
      <pin position="88" pad="PD12" />
      <pin position="89" pad="PD18" />
      <pin position="90" pad="PD13" />
      <pin position="91" pad="VSSIO" />
      <pin position="92" pad="VDDF" />
      <pin position="93" pad="PD06" />
      <pin position="94" pad="PD07" />
      <pin position="95" pad="PD19" />
      <pin position="96" pad="PD04" />
      <pin position="97" pad="PD05" />
      <pin position="98" pad="PD08" />
      <pin position="99" pad="PD20" />
      <pin position="100" pad="PD09" />
    </pinout>
  </pinouts>
</avr-tools-device-file>